[
  {
    "slug": "anthropology",
    "name": "Anthropology",
    "department": "Anthropology",
    "degree": {
      "undergraduate": "BA",
      "postgraduate": "MA",
      "research": "PhD"
    },
    "faculty": "Arts, Humanities and Social Sciences",
    "excerpt": "<p><strong>Anthropology</strong> explores how people and groups across the globe engage with the social, cultural, political, and economic processes that shape the contemporary world.</p><p><strong>Anthropologists</strong> spend extended periods of time with the people whose lives they study in order to understand their practices, languages, and teachings as well as how they are entangled with systems of power.</p><p><strong>Anthropologists</strong> facilitate cross-cultural understanding and critical engagement with global problems.</p>",
    "desc": "The study of anthropology provides a strong background for students who intend to specialize in any of the social sciences and humanities or in medicine, nursing, social work, education, law, business, government, communications, and many other fields that require a nuanced understanding of decolonization, global processes, and a strong grounding in the cross-cultural study of human histories, languages, identities, and behaviours. Students of anthropology have gone on to find employment with public, private and non-government organizations in diverse fields, including: academia and public policy; print, radio, and television journalism; documentary film-making; healthcare; international development; and social and environmental activism.",
    "requirements": "<ul><li>BA - Direct entry into the faculty is subject to your meeting the general undergraduate admission requirements.</li><li>MA - Bachelor's degree (minimum second class) normally in Anthropology or cognate discipline with a minimum of 75% in all Anthropology courses. For applicants with degrees in other disciplines, preference will be given to those with coursework in Anthropology with a minimum of 75% in each course.</li><li>PhD - normally a Master's degree in Anthropology with a minimum of 80% in graduate courses. Applicants with a Bachelor's degree in Anthropology and a Master's degree in a cognate discipline with a minimum of 80% in graduate courses are also considered.</li></ul>",
    "career": "<p>Students of anthropology have gone on to find employment in:</p><ul><li>public policy</li><li>journalism</li><li>international and public health</li><li>human and social services</li><li>human rights and social justice advocacy</li><li>environmental and natural resources</li><li>community development</li><li>international development</li><li>software development</li><li>information technology</li><li>product and service design</li></ul>",
    "program": {
      "undergraduate": "Bachelor of Arts (B.A.)",
      "postgraduate": "Master of Arts (M.A.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "archaeology",
    "name": "Archaeology",
    "department": "Archaeology",
    "faculty": "Arts, Humanities and Social Sciences",
    "degree": {
      "undergraduate": "BA",
      "postgraduate": "MA",
      "research": "PhD"
    },
    "excerpt": "Archaeology studies past and contemporary human cultures, across a variety of spatial and temporal scales, through the material left behind. Our objects of study encompass artifacts (e.g. tools and other objects modified or created by humans), features (e.g. architectural remains, hearths, artistic depictions), ecofacts (e.g. plant, animal and human remains, as well as sediments), archaeological sites and their associated landscape settings.",
    "desc": "<p>In the Department of Archaeology, our students engage in practical training and experiential learning in classroom, laboratory and fieldwork settings that provide a comprehensive education and transferable skills. We have begun to develop and expand our distance learning options through the development of online courses and remote teaching offerings that allow students from all over the world and different walks of life to join and learn with us and discover different aspects of archaeology. State of the art laboratories specializing in applied archaeological sciences, environmental archaeology, archaeological conservation, and artifact analysis integrate students into community-university research initiatives from UK to French Guiana and from Alaska to Northwest Europe.</p><p>As one of the largest Archaeology departments in the country, we train our students to become effective researchers, critical thinkers, and active stewards for our shared archaeological heritage.</p>",
    "requirements": "<ul><li>BA - Direct entry into the faculty is subject to your meeting the general undergraduate admission requirements </li><li>MA - Bachelor's degree in an appropriate area of study</li><li>PhD - Master's degree in an appropriate area of study</li></ul>",
    "career": "<p>A degree, with a major in archaeology, prepares students for a variety of careers including:</p><ul><li>cultural resource management</li><li>museums and archives</li><li>heritage administration</li><li>community research</li><li>tourism</li><li>education</li></ul>",
    "program": {
      "undergraduate": "Bachelor of Arts (B.A.)",
      "postgraduate": "Master of Arts (M.A.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "architecture",
    "name": "Architecture",
    "department": "Architecture",
    "faculty": "Engineering and Applied Science",
    "degree": {
      "undergraduate": "BArch",
      "postgraduate": "MArch",
      "research": "PhD"
    },
    "excerpt": "The Architecture degree combines the intellectual challenges of both arts and sciences with the opportunity to explore the possibilities of creative design.",
    "desc": "<p>The Architecture Department offers two degrees: Architecture, which offers the quickest route to qualification as an architect; and Design, which combines architecture, engineering and materials science.</p><p>Creativity, curiosity and strong intellectual grounding are central to the Architecture course. Our innovative design programme is balanced with outstanding teaching in the history and philosophy of architecture, contemporary culture and urbanism, as well as construction, structural design and environmental design.</p><p>Our small, friendly Department has a good staff to student ratio, and the supportive community atmosphere gives students the opportunity to push the boundaries of the field and to extend their own abilities in exciting new directions. Facilities include a superb library, reprographics areas, new digital fabrication laboratory,&nbsp;workshops, and studio spaces for students in all years.</p>",
    "requirements": "<ul><li>BArch - To apply for admission into the Faculty of Engineering and Applied Science, indicate bachelor of engineering in the appropriate place on the&amp;nbsp;undergraduate application for admission. In addition to meeting the&amp;nbsp;general admission requirements, you will also need to meet the admission requirements set out by the&amp;nbsp;Faculty of Engineering and Applied Science.&nbsp;</li><li>MArch - Bachelor&#39;s degree (minimum second class) in Architecture or equivalent</li></ul><ul><li>PhD &ndash; Master&rsquo;s degree in an appropriate area of study&nbsp;</li></ul>",
    "career": "Many graduates continue into professional training or enter other creative fields. Some choose to take up research in areas such as history and philosophy of architecture, environmentally responsible design, architecture and the moving image, urban design and transport planning, and disaster relief.",
    "program": {
      "undergraduate": "Bachelor of Architecture (B.Arch.)",
      "postgraduate": "Master of Architecture (M.Arch.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "artificial-intelligence",
    "name": "Artificial Intelligence",
    "department": "Artificial Intelligence",
    "faculty": "Science",
    "degree": { "postgraduate": "MSc" },
    "excerpt": "We are increasingly utilizing various “smart” or “autonomous” technologies, that have artificial intelligence at the heart of their technological function. With an increased reliance on these technologies, there is an ever-increasing demand for specialists being able to envision how to solve problems with AI technologies, and to develop, understand and maintain AI-based systems. Given the continuing demand for AI specialists and the expected accelerated growth of this profession over the next few decades, Memorial University is offering a Master of Artificial Intelligence program.",
    "desc": "The Master of Artificial Intelligence is a course-based Master’s program intended for students who wish to gain the skills to integrate and deploy Artificial Intelligence in a variety of sectors. The Master of Artificial Intelligence (MAI) is a four-term, course-based Master's program offered jointly by the Department of Computer Science (Faculty of Science) and the Department of Computer Engineering (Faculty of Engineering and Applied Sciences) intended for students with a computer science, computer engineering or scientific computing background who wish to upgrade their background to specialize in artificial intelligence.",
    "requirements": "<ul><li>Applicants must have a four-year undergraduate degree (or the equivalent) in computer science, computer engineering, or a related area such as data science, scientific computing, bioinformatics, or computational chemistry.</li></ul><ul><li>Applicants shall normally hold a minimum Second-Class Upper standing (or have at least a 75% general average).</li></ul><ul><li>Applicants must have taken at least one course in each of the following areas: linear algebra, vector calculus, statistics, and computer programming.</li><li>Applicants must meet the English proficiency requirements for graduate programs with higher English proficiency requirements described in the website of the School of Graduate Studies.</li></ul>",
    "career": "Graduates of the program will have knowledge and understanding of the core areas and methods of Artificial Intelligence and will be ready to work in applied positions in a variety of areas including, but not limited to, autonomous vehicles, automated decision making, intelligent sensing, precision agriculture, personalized medicine, financial security, smart appliances, and other emerging areas that will be vital to future economic growth. We foresee graduates working in both the private and public sectors locally and internationally.",
    "program": { "postgraduate": "Master of Science (M.Sc.)" },
    "qualification": {
      "postgraduate": "Master's degree (Postgruaduate taught)"
    },
    "duration": { "postgraduate": "1 year" }
  },
  {
    "slug": "biochemistry",
    "name": "Biochemistry",
    "department": "Biochemistry",
    "faculty": "Science",
    "degree": {
      "undergraduate": "BSc",
      "postgraduate": "MSc",
      "research": "PhD"
    },
    "excerpt": "This is a biochemistry degree which is designed specifically to prepare students for further specialization in the chemistry of biological systems but also serves as an appropriate background for graduate studies in any area of chemistry. The degree will also serve those students who wish to enter health related careers such as medicine and those who wish to pursue other chemistry related careers. The degree also provides two teachable subjects for students interested in teaching at the intermediate and secondary school levels.",
    "desc": "The Department of Biochemistry has state-of-the-art spectroscopic and other analytical instrumentation as well as the high performance computer facilities of ACEnet. We also have extensive computing facilities for chemistry majors and honours students.",
    "requirements": "<ul><li>BSc - Direct entry into the Faculty of Science from high school is subject to meeting the general admission requirements, including appropriate courses in mathematics and a laboratory science.</li><li>MSc - Bachelor's degree (minimum second class) in an appropriate area of study</li><li>PhD - Master's degree in an appropriate area of study </li></ul>",
    "career": "<p>A degree in Biochemistry, prepares students for a variety of careers including:</p><ul><li>business</li><li>biochemist</li><li>medicine</li><li>teacher</li><li>research (MSc or PhD degrees)</li><li>law</li><li>professor</li><li>forensic scientist</li></ul>",
    "program": {
      "undergraduate": "Bachelor of Science (B.Sc.)",
      "postgraduate": "Master of Science (M.Sc.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "biology",
    "name": "Biology",
    "department": "Biology",
    "faculty": "Science",
    "degree": {
      "undergraduate": "BSc",
      "postgraduate": "MSc",
      "research": "PhD"
    },
    "excerpt": "Biology is the study of life and of living organisms, including their structure, function, growth, origin, evolution and distribution. Of all the sciences, biology is perhaps the most closely related to everyday life. We are exposed daily to news and documentary reports on biological topics such as genetic engineering, environmental conservation, pollution, disease and immunology, social and behavioural interactions and population growth.",
    "desc": "Our programs offer tremendous field and laboratory research opportunities for undergraduate students. In the biology program you have opportunities to become involved in laboratory research.",
    "requirements": "<ul><li>BSc - Direct entry into the Faculty of Science from high school is subject to meeting the general admission requirements, including appropriate courses in mathematics and a laboratory science</li><li>MSc - Bachelor's degree (minimum second class) in an appropriate area of study</li><li>PhD - Master's degree in an appropriate area of study </li></ul>",
    "career": "<p>A degree in biology prepares students for a variety of careers including:</p><ul><li>fisheries officer</li><li>wildlife officer</li><li>marine or aquaculture biologist</li><li>bio or medical technologist</li><li>horticulturist</li><li>science teacher</li><li>veterinarian</li></ul>",
    "program": {
      "undergraduate": "Bachelor of Science (B.Sc.)",
      "postgraduate": "Master of Science (M.Sc.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "Business-Administration",
    "name": "Business Administration",
    "department": "Business Administration",
    "faculty": "Business",
    "degree": { "undergraduate": "BBA", "postgraduate": "MBA" },
    "excerpt": "<p>We all engage with businesses and organizations on a daily basis&mdash;from our local shops to big box stores, from our places of work to our kid's school, from the non-profit group where we volunteer our time, to our places of civic engagement. </p><p>Regardless of the industry or profession you may aspire to or already find yourself in, studying business in its many forms will push you to consider how organizations, and the people in them, impact every aspect of our lives. </p>",
    "desc": "<p>We invite you to examine the world of business through your pursuit of a minor in business, a Bachelor of Business Administration (including an honours option), or a Masters of Business Administration. Of course, you may also choose to explore individual courses of interest like introduction to business or entrepreneurship, which complement studies in any university program.</p><p>The program will help you to build competence and confidence in the skills that will equip you to positively shape and build your organizations and your communities. Here you will critically reflect on what it means to work with diverse people, resources, ideas, and mandates, as you examine subject areas like accounting and finance, marketing and communications, entrepreneurship and innovation, leadership and human resources, and strategy and change management.</p><p>Join us to share and build your business knowledge, skills, and experiences!</p>",
    "requirements": "<ul><li>BBA - Direct entry into the Faculty of Business Administration from high school is subject to meeting the general admission requirements, including appropriate courses in mathematics</li><li>MBA - Bachelor's degree (minimum second class) in an appropriate area of study</li></ul>",
    "career": "<ul><li>Financial manager</li><li>Information technology, or IT, manager</li><li>Management consultant</li><li>Medical and health services manager</li><li>Operations research analyst</li><li>Personal financial advisor</li></ul>",
    "program": {
      "undergraduate": "Bachelor of Business Administration (B.BA.)",
      "postgraduate": "Master of Business Administration (M.BA.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)"
    },
    "duration": { "undergraduate": "4 years", "postgraduate": "1 year" }
  },
  {
    "slug": "chemistry",
    "name": "Chemistry",
    "department": "Chemistry",
    "faculty": "Science",
    "degree": {
      "undergraduate": "BSc",
      "postgraduate": "MSc",
      "research": "PhD"
    },
    "excerpt": "Chemistry is the science of the composition, structure, properties and reactions of matter, especially of atomic and molecular systems. The synthesis of new drugs, the production of novel materials and the monitoring and improvement of our environment all involve the science of chemistry. The modern-day subject of chemistry is a dynamically-changing science that is about cutting-edge discoveries and the use of state-of-the-art techniques and technologies that impact almost every aspect of human life and almost every aspect of the development of human society. It is easy to understand why the field of chemistry is often described as the central science.",
    "desc": "<p>The Department of Chemistry has state-of-the-art spectroscopic and other analytical instrumentation as well as high performance computer facilities such as ACEnet.</p><p>In addition to the major, minor and honours options in chemistry, joint programs are offered in:</p><ul><li>applied mathematics/chemistry (B.Sc. honours)</li><li>biochemistry/chemistry (B.Sc. honours)</li><li>chemistry/Earth sciences (B.Sc. honours)</li><li>chemistry/physics (B.Sc. honours)</li></ul><p>Chemistry majors and honours students have the option to complete a minor in applied science (process engineering) through the Faculty of Engineering and Applied Science.</p>",
    "requirements": "<ul><li>BSc - Direct entry into the Faculty of Science from high school is subject to meeting the general undergraduate admission requirements, including appropriate courses in mathematics and a laboratory science</li><li>MSc - Bachelor's degree (minimum second class) in an appropriate area of study</li><li>PhD - Master's degree in an appropriate area of study </li></ul>",
    "career": "<p>A degree in chemistry prepares students for a variety of careers including:</p><ul><li>art conservationist</li><li>brew master</li><li>chemical laboratory technician</li><li>school/university educator</li><li>patent lawyer</li><li>clinical chemist</li><li>forensic chemist</li><li>chemistry teacher</li></ul>",
    "program": {
      "undergraduate": "Bachelor of Science (B.Sc.)",
      "postgraduate": "Master of Science (M.Sc.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "civil-engineering",
    "name": "Civil Engineering",
    "department": "Civil Engineering",
    "faculty": "Engineering and Applied Science",
    "degree": {
      "undergraduate": "BEng",
      "postgraduate": "MEng",
      "research": "PhD"
    },
    "excerpt": "Civil engineering is a broad field encompassing several distinct areas of specialization. It is also the oldest of the engineering professions. Civil engineers work in all levels of government and for a wide variety of industries involved in the design, planning, managing and construction of highways, airports, harbours, dams, buildings, pollution control and so much more.",
    "desc": "Our civil engineering program is unique for students hoping to work in the field of offshore oil and gas development due to the university’s proximity to the ocean. The civil engineering program is co-operative education-based and offers well-balanced, diversified courses across a wide range of engineering specialties such as structural; construction; geotechnical; water resources; environmental; transportation; and offshore, coastal and ocean.",
    "requirements": "<ul><li>BEng - To apply for admission into the Faculty of Engineering and Applied Science, indicate bachelor of engineering in the appropriate place on the undergraduate application for admission. In addition to meeting the general admission requirements, you will also need to meet the admission requirements set out by the Faculty of Engineering and Applied Science.</li><li>MEng - Bachelor's degree (minimum second class or &lsquo;B' standing) in an appropriate area of study</li><li>PhD - Master's degree in an appropriate area of study (applicant's rank in class, referees' assessments, general performance through previous academic programs, and availability of supervisors will all be considered)</li></ul>",
    "career": "<p>A degree in civil engineering, prepares students for a variety of careers including:</p><ul><li>design engineer</li><li>project manager</li><li>cost estimator</li><li>piping designer</li><li>environmental consultant</li><li>building designer</li><li>project manager</li></ul><p><strong>Note:</strong> some of these careers may call for supplementary education or preparation in the form of graduate studies, experiential learning or professional courses and exams.</p>",
    "program": {
      "undergraduate": "Bachelor of Engineering (B.Eng.)",
      "postgraduate": "Master of Engineering (M.Eng.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "classics",
    "name": "Classics",
    "department": "Classics",
    "faculty": "Arts, Humanities and Social Sciences",
    "degree": {
      "undergraduate": "BA",
      "postgraduate": "MA",
      "research": "PhD"
    },
    "excerpt": "Classics explores the cultures and societies of ancient Greece and Rome within the broader context of the ancient Mediterranean. Such study is intrinsically multidisciplinary, encompassing Latin and ancient Greek texts, archaeology, intellectual history, material culture, the influence of Greco-Roman antiquity on later societies, and perspectives on gender, ethnicity, and socio-economic class. Classics is a discipline rooted in the past, yet relevant to the contemporary world and modern institutions. The study of classical antiquity and its subsequent traditions helps students make informed observations about the present and the future.",
    "desc": "Courses in the Department of Classics encompass a broad range of topics related to ancient Greece and Rome, from history and archaeology to literature, philosophy, and the arts. Our course offerings are especially strong in the areas of ancient technology, ancient medicine, ancient historiography, Greek and Roman literature, and classical reception studies. Recent projects include a language-teaching consortium with the Department of Classics at Dalhousie University and an ongoing collaboration with classicists at the University of Ibadan, Nigeria.",
    "requirements": "<ul><li>BA - You may apply for admission into the Faculty of Arts, Humanities and Social Sciences by indicating bachelor of arts as your program choice on the undergraduate application for admission. Direct entry into the faculty is subject to your meeting the general admission requirements.</li><li>MA - Bachelor's degree (minimum second class or &lsquo;B' standing) in an appropriate area of study</li><li>PhD - Master's degree in an appropriate area of study (applicant's rank in class, referees' assessments, general performance through previous academic programs, and availability of supervisors will all be considered)</li></ul>",
    "career": "<p>A classics degree prepares you for a multitude of career options including:</p><ul><li>museum worker</li><li>conservator/restorer</li><li>librarian</li><li>architect</li><li>textual editor</li></ul><p><strong>Note:</strong> some of these careers may call for supplementary education or preparation in the form of graduate studies, experiential learning or professional courses and exams.</p>",
    "program": {
      "undergraduate": "Bachelor of Arts (B.A.)",
      "postgraduate": "Master of Arts (M.A.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "cognitive-and-behavioural-ecology",
    "name": "Cognitive and Behavioural Ecology",
    "department": "Biology",
    "faculty": "Science",
    "degree": { "postgraduate": "MSc", "research": "PhD" },
    "excerpt": "The Cognitive and Behavioural Ecology Program (CABE) is an interdisciplinary graduate program focused on animal behaviour and behavioural ecology. It is designed to train students in research that integrates cognitive and behavioural studies at the ecological level. Molecular, developmental, and evolutionary aspects of cognition and behaviour are also studied. Supervisors include faculty from the Departments of Biology, Ocean Sciences, and Psychology, the Faculty of Medicine, and the Environmental Science, and Parks Scotland.",
    "desc": "<ul><li>MSc - The MSc program involves courses and a thesis and can be completed in one year of full-time study.</li></ul><ul><li>PhD - The PhD program involves courses, a comprehensive exam, and a thesis, and can be completed in three years of full-time study.</li></ul>",
    "requirements": "<ul><li>MSc - Bachelor's degree (minimum second class) in an appropriate area of study</li></ul><ul><li>PhD - Master's degree in an appropriate area of study</li></ul>",
    "career": "<p>Many students go on to work in conservation and natural resource management, government agencies, biotechnology, healthcare, non-profits, forensic science, science communication and outreach, environmental consulting, teaching, parks and nature reserves, research labs, zoos, natural history museums, and ecotourism.</p><p>Many students also choose to pursue further education: graduate school for a MSc or PhD, veterinary or medical school, law school, business school, or public health programs.</p>",
    "program": {
      "postgraduate": "Master of Science (M.Sc.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": { "postgraduate": "1 year", "research": "3 years" }
  },
  {
    "slug": "commerce",
    "name": "Commerce",
    "department": "Commerce",
    "faculty": "Business",
    "degree": { "undergraduate": "BComm" },
    "excerpt": "Our bachelor of commerce (B.Comm.) is ideal for students seeking flexibility. It allows students to develop the expertise required for a career in business while customizing the pace and location of their studies.",
    "desc": "Students are required to complete three non-credit, professional development seminars. These seminars, delivered in partnership with the Gardiner Centre, complement academic programming and help prepare students to succeed in the workforce. Areas of learning will include career development, job search, professionalism and individual skill development.",
    "requirements": "You may apply for admission into Business directly from high school. Direct entry into the faculty from high school is subject to meeting the general admission requirements.",
    "career": "<p>Our commerce graduates are known for their strong understanding of business issues and processes, their resourcefulness, and their problem-solving and leadership skills. the bachelor of commerce degree will give you the breadth, depth, and experience you need to be career-ready and join the workforce directly. Feel confident that your degree will take you further with our employer reputation, which is why we are ranked #8 for graduate employability worldwide (QS 2021).</p><p>Depending on your chosen major(s), the Bachelor of Commerce, together with other specified membership requirements, satisfies the accreditation requirements of a number of Australian professional associations. The benefits including access to industry networks, jobs, conferences, internationally recognised credentials and more. Some careers include:</p><ul><li>Account executive</li><li>Accountant</li><li>Actuary</li><li>Brand manager</li><li>Business analyst</li><li>Consultant</li><li>Customer experience expert</li><li>Customer insights analyst</li><li>Digital marketing manager</li><li>HR executive</li><li>Researcher</li><li>Sustainability analyst</li><li>Social media manager</li><li>Supply chain manager</li><li>Startup founder</li></ul>",
    "program": { "undergraduate": "Bachelor of Commerce (B.Comm.)" },
    "qualification": { "undergraduate": "Bachelor's degree (Undergruaduate)" },
    "duration": { "undergraduate": "4 years" }
  },
  {
    "slug": "communication-studies",
    "name": "Communication studies",
    "department": "English",
    "faculty": "Arts, Humanities and Social Sciences",
    "degree": { "undergraduate": "BA" },
    "excerpt": "The study of media and communication addresses many contemporary questions. Who controls the media and why? What shape does communication take in today’s global world? What are the different media technologies and at whom are they targeted? Communication studies addresses these questions and others as it critically examines the role and development of communication in modern society.",
    "desc": "<p>The communication studies major has been one of the fastest growing programs since its introduction in 2010. As an interdisciplinary program it provides exposure to courses in various disciplines within the Faculty of Humanities and Social Sciences.</p><p>Communication studies is housed in the Department of English.</p>",
    "requirements": "You may apply for admission into the Faculty of Arts, Humanities and Social Sciences by indicating bachelor of arts as your program choice on the undergraduate application for admission. Direct entry into the faculty is subject to your meeting the general admission requirements.",
    "career": "<p>A bachelor of arts degree, with a major in communication studies, prepares students for a variety of careers including:</p><ul><li>advertising</li><li>human resources management</li><li>public relations</li><li>education</li><li>consulting</li><li>telecommunications</li><li>broadcasting</li><li>fine and performing arts</li><li>writing</li><li>publishing</li><li>research (academic and business)</li></ul><p>Communication studies is also excellent preparation if you intend to pursue a career in law, journalism, film or politics.</p>",
    "program": { "undergraduate": "Bachelor of Arts (B.A.)" },
    "qualification": { "undergraduate": "Bachelor's degree (Undergruaduate)" },
    "duration": { "undergraduate": "4 years" }
  },
  {
    "slug": "computational-chemistry",
    "name": "Computational chemistry",
    "department": "Chemistry",
    "faculty": "Science",
    "degree": { "undergraduate": "BSc" },
    "excerpt": "Computational chemistry uses computers and software to model the behaviour and properties of chemical systems, from individual atoms to the large proteins found in living things. These models lead to the design of molecules for new drugs and materials in medicine, and new ways to store and transport energy and information.",
    "desc": "The Department of Chemistry has state-of-the-art spectroscopic and other analytical instrumentation as well as the high performance computer facilities of ACEnet. We also have extensive computing facilities for chemistry majors and honours students.",
    "requirements": "Direct entry into the Faculty of Science from high school is subject to meeting the general admission requirements, including appropriate courses in mathematics and a laboratory science.",
    "career": "<p>A bachelor of science degree, with a major in computational chemistry, prepares students for a variety of careers including:</p><ul><li>crystallography</li><li>database development</li><li>environmental science</li><li>scientific software developers</li><li>research associate</li><li>geosciences</li><li>forensics</li></ul>",
    "program": { "undergraduate": "Bachelor of Science (B.Sc.)" },
    "qualification": { "undergraduate": "Bachelor's degree (Undergruaduate)" },
    "duration": { "undergraduate": "4 years" }
  },
  {
    "slug": "computational-mathematics",
    "name": "Computational mathematics",
    "department": "Mathematics",
    "faculty": "Science",
    "degree": { "undergraduate": "BSc" },
    "excerpt": "<p>Math is all around us, from landing that perfect snowboard jump to designing the next best-selling app. It's about discovering this place we live in through algorithms, calculations and logical reasoning. The computational mathematics program is a four-year bachelor of science degree. Students strengthen their logical reasoning skills and can gain technical knowledge in diverse areas, including:</p><ul><li>Economics</li><li>Engineering</li><li>Physics</li><li>Biology</li><li>Chemistry</li><li>Psychology</li><li>Business</li><li>Computer science</li></ul>",
    "desc": "Computational mathematics is about solving real world problems with numbers. It’s about learning to think critically and developing analytical skills that will prepare you for countless opportunities. Computational mathematics is the language of the future. You’ll gain the skills you need to navigate the numbers and prepare for the evolution of many industries.In computational mathematics program, you‘ll take courses such as:Differential equationsNumerical analysisApplied graph theoryStatisticsVector calculusLogical reasoningAlgorithms and complexity​Our faculty is passionate about mathematics. Their research includes game theory, recreational mathematics, cryptography, model theory, combinatorial designs, error correcting codes and dynamic systems. And you may even have the chance to work with them as a student researcher.",
    "requirements": "<p>You must meet to the general admission requirements and declare computational mathematics as your major to be admitted to the program.</p><p>Students can apply for admission directly from high school. Or, if you have attended another post-secondary institution, you can apply for advanced standing.</p>",
    "career": "<p>Graduates of computational mathematics degree program find career opportunities in a variety of industries, such as:</p><ul><li>Software development</li><li>Market/risk analysis</li><li>Aerospace and aviation</li><li>Telecommunications</li><li>Biotechnology</li><li>Entrepreneurial ventures</li><li>Accountant</li><li>Demography</li><li>Epidemiology</li><li>Forensic science</li><li>Meteorology</li><li>Financial advising</li></ul><p>Graduates also do very well on law and business entrance exams.</p>",
    "program": { "undergraduate": "Bachelor of Science (B.Sc.)" },
    "qualification": { "undergraduate": "Bachelor's degree (Undergruaduate)" },
    "duration": { "undergraduate": "4 years" }
  },
  {
    "slug": "computer-engineering",
    "name": "Computer Engineering",
    "department": "Computer Engineering",
    "faculty": "Engineering and Applied Science",
    "degree": {
      "undergraduate": "BEng",
      "postgraduate": "MEng",
      "research": "PhD"
    },
    "excerpt": "Computer engineering is a fast-changing discipline concerned with the design and analysis of computer systems applied to the solution of practical problems. It encompasses both computer hardware and software design in applications ranging from telecommunications and information systems (such as the Internet or telephone networks) to instrumentation and robotics.",
    "desc": "Computer engineering includes a mandatory, integrated co-operative education program in which students gain up to two years of practical work experience. You will take courses in computer hardware, software and communications systems and learn about circuit analysis, systems and signals, digital logic design, electronics, software design and implementation, computer architecture and microprocessors, computer networking, concurrent programming and real-time operating systems. You will participate in design projects throughout the program, including a team capstone design project in your final year that may span computer and electrical engineering and involve students from both majors. ",
    "requirements": "<ul><li>BEng - To apply for admission into the Faculty of Engineering and Applied Science, indicate bachelor of engineering in the appropriate place on the undergraduate application for admission. In addition to meeting the general admission requirements, you will also need to meet the admission requirements set out by the Faculty of Engineering and Applied Science.</li><li>MEng - Bachelor's degree (minimum second class or 'B' standing) in an appropriate area of study</li><li>PhD - Master's degree in an appropriate area of study (applicant's rank in class, referees' assessments, general performance through previous academic programs, and availability of supervisors will all be considered)</li></ul>",
    "career": "<p>A degree in computer engineering, prepares students for a variety of careers including:</p><ul><li>software design engineer</li><li>network planning engineer</li><li>digital hardware design engineer</li><li>system manager</li><li>communications engineer</li></ul>",
    "program": {
      "undergraduate": "Bachelor of Engineering (B.Eng.)",
      "postgraduate": "Master of Engineering (M.Eng.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "computer-science",
    "name": "Computer science",
    "department": "Computer science",
    "faculty": "Science",
    "degree": {
      "undergraduate": "BSc",
      "postgraduate": "MSc",
      "research": "PhD"
    },
    "excerpt": "<p>Computer science deals with the theoretical foundations of information and computation, and with practical techniques for their implementation and application.</p><p>Virtually every discipline - practical, theoretical or creative - is experiencing the influence of computers. The ever-increasing dependence on computer technology in our daily lives presents rich opportunities for those interested in the design of new applications and systems. Every career can benefit from a deeper understanding of computing. The technology skills a major in computer science helps develop will make you indispensable and relevant no matter your position.</p>",
    "desc": "<p>We offer individual courses and full programs so any student can develop their computer skills and interest regardless of their career trajectory. Internship in Computer Science provides an opportunity for you to obtain rewarding placements in computer industries. The internship program includes a paid placement of eight to 16 months so you can explore career options and develop workplace skills at the same time.</p><p>We offer major, minor and honours programs leading to either a bachelor of science (B.Sc.) in computer science or a B.Sc. honours program in computer science (software engineering). Joint programs are available in:</p><ul><li>applied mathematics/computer science (B.Sc. major)</li><li>computer science/economics (B.Sc. major)</li><li>computer science/geography (B.Sc. major and honours)</li><li>computer science/physics (B.Sc. major and honours)</li><li>computer science/pure mathematics (B.Sc. major and honours)</li><li>computer science/statistics (B.Sc. major and honours)</li></ul>",
    "requirements": "<ul><li>BSc - Direct entry into the Faculty of Science from high school is subject to meeting the general admission, including appropriate courses in mathematics and a laboratory science for bachelor of science. </li><li>MSc - Bachelor degree (major in Computer Science or Computer Engineering) with a minimum average of 75% overall (international applicants are strongly encouraged to submit a valid GRE score report)</li></ul><ul><li>PhD - Master's degree in an appropriate area of study (international applicants are strongly encouraged to submit a valid GRE score report)</li></ul>",
    "career": "<p>A degree in computer science, prepares students for a variety of careers including:</p><ul><li>computational scientist</li><li>computer architect</li><li>game programmer</li><li>cyber security</li><li>systems analyst/designer</li><li>robotics programmer</li><li>software developer</li></ul><p>Our students work in national and international firms such as IBM, Apple, Microsoft, EA Games, as well as in the oil and gas sector and in local industry.</p>",
    "program": {
      "undergraduate": "Bachelor of Science (B.Sc.)",
      "postgraduate": "Master of Science (M.Sc.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "computer-science-data-centric-computing",
    "name": "Computer science (data centric computing)",
    "department": "Computer Science",
    "faculty": "Science",
    "degree": { "undergraduate": "BSc" },
    "excerpt": "",
    "desc": "Data is essential in today’s industries, science and government, and data scientists are in high demand. Data plays a vital role in decision making in many areas such as social sciences, business, biomedical science, and government policy. Our data centric computing stream will prepare students to deal with data at every step of the data processing cycle to transform data into useful information.",
    "requirements": "<p>Entry into the computer science (data centric computing) major is competitive and selective. Selection is based on academic performance, normally cumulative average and performance in recent courses.</p><p>Direct entry into the Faculty of Science from high school is subject to meeting the general admission requirements, including appropriate courses in mathematics and a laboratory science for bachelor of science.</p>",
    "career": "<ul><li><p>A bachelor of science degree, with a major in data centric computing, prepares students for a variety of careers including:</p></li><li>data analyst</li><li>business analyst</li><li>data mining specialist</li><li>database administrator</li></ul>",
    "program": { "undergraduate": "Bachelor of Science (B.Sc.)" },
    "qualification": { "undergraduate": "Bachelor's degree (Undergruaduate)" },
    "duration": { "undergraduate": "4 years" }
  },
  {
    "slug": "computer-science-smart-systems",
    "name": "Computer science (smart systems)",
    "department": "Computer Science",
    "faculty": "Science",
    "degree": { "undergraduate": "BSc" },
    "excerpt": "Computer science is the study of computers and computational systems. It is a broad field which includes everything from the algorithms that make up software to how software interacts with hardware to how well software is developed and designed.",
    "desc": "The smart systems major gives an overview of the growing body of algorithmic and mathematical techniques that have proven practical in allowing computer systems to deal with the complexities and uncertainties of both human beings and the real world.",
    "requirements": "<p>Entry into the computer science (smart systems) major is competitive and selective. Selection is based on academic performance, normally cumulative average and performance in recent courses.</p><p>Direct entry into the Faculty of Science from high school is subject to meeting the general admission requirements, including appropriate courses in mathematics and a laboratory science for bachelor of science.</p>",
    "career": "<p>A bachelor of science degree, with a major in smart systems, prepares students for a variety of careers including:</p><ul><li>artificial intelligence developers</li><li>mobile computing developers</li><li>robotics programmers</li><li>IT specialists</li><li>software developers</li><li>web specialists</li></ul><p>Our students work in national and international firms such as IBM, Apple, Microsoft, EA Games, as well as in the oil and gas sector and in local industry.</p>",
    "program": { "undergraduate": "Bachelor of Science (B.Sc.)" },
    "qualification": { "undergraduate": "Bachelor's degree (Undergruaduate)" },
    "duration": { "undergraduate": "4 years" }
  },
  {
    "slug": "computer-science-visual-computing-and-games",
    "name": "Computer science (visual computing and games)",
    "department": "Computer Science",
    "faculty": "Science",
    "degree": { "undergraduate": "BSc" },
    "excerpt": "Computer science is the study of computers and computational systems. It is a broad field which includes everything from the algorithms that make up software to how software interacts with hardware to how well software is developed and designed.",
    "desc": "The visual computing and games major studies how to use computers to both mimic human visual processing power for things such as object recognition, and to create visual content, like games and movies. Computer games also offer a great opportunity for computer scientists to learn and apply fundamental concepts of design and creation of interactive experiences and visual content.",
    "requirements": "<p>Entry into the Computer science (visual computing and games) major is competitive and selective. Selection is based on academic performance, normally cumulative average and performance in recent courses.</p><p>Direct entry into the Faculty of Science from high school is subject to meeting the general admission requirements, including appropriate courses in mathematics and a laboratory science for bachelor of science.</p>",
    "career": "<p>A bachelor of science degree, with a major in visual computing and games, prepares students for a variety of careers including:</p><ul><li>game programmers</li><li>computer graphics developers</li><li>computer vision developers</li><li>mobile computing developers</li><li>robotics programmers</li><li>IT specialists</li><li>software developers</li><li>web specialists</li></ul><p>Our students work in national and international firms such as IBM, Apple, Microsoft, EA Games, as well as in the oil and gas sector and in local industry.</p><p><strong>Note:</strong> some of these careers may call for supplementary educati</p>",
    "program": { "undergraduate": "Bachelor of Science (B.Sc.)" },
    "qualification": { "undergraduate": "Bachelor's degree (Undergruaduate)" },
    "duration": { "undergraduate": "4 years" }
  },
  {
    "slug": "creative-writing",
    "name": "Creative Writing",
    "department": "English",
    "faculty": "Arts, Humanities and Social Sciences",
    "degree": { "undergraduate": "BA" },
    "excerpt": "",
    "desc": "<p>The bachelor in creative writing aims to develop students' skills in writing in a variety of genres conventionally described as &ldquo;creative,&rdquo; such as fiction, poetry, drama, and creative non-fiction. It will also offer you the opportunity to take, as options, courses that provide a background in contemporary literature in these genres. The overall aim of the program is to help you produce work that merits publication. To this end, the focus of the creative writing courses will be on the composition, critiquing, and editing of your own work, and, in both the creative writing and contemporary literature courses, on analyzing examples of excellent contemporary writing.</p><p>Interested students should note that admission to individual creative writing courses is competitive and administered via the portfolio system.</p>",
    "requirements": "Direct admission to this program is available. Interested applicants who are not current students should submit an undergraduate application for admission",
    "career": "<ul><li>Author</li><li>Editor</li><li>Greeting Card Writer</li><li>Reviewer (books, products, etc.)</li><li>Writing Coach/Consultant</li><li>Advertising/Marketing (creative)</li><li>Instructor</li><li>Ghostwriter</li><li>Travel Writer</li><li>Article Writer</li><li>Columnist</li><li>Video Game Writer</li><li>Personal Poet</li><li>Playwright</li><li>Blogger</li><li>Technical Writer</li><li>Website Content Writer</li><li>Proofreader</li><li>Speech Writer</li><li>Public Relations</li><li>Screenwriter</li><li>Librarian</li><li>Researcher</li><li>Grant Writer</li><li>Public Relations</li></ul>",
    "program": { "undergraduate": "Bachelor of Arts (B.A.)" },
    "qualification": { "undergraduate": "Bachelor's degree (Undergruaduate)" },
    "duration": { "undergraduate": "4 years" }
  },
  {
    "slug": "criminology",
    "name": "Criminology",
    "department": "Sociology",
    "faculty": "Arts, Humanities and Social Sciences",
    "degree": { "undergraduate": "BA" },
    "excerpt": "The major in criminology, administered by the Department of Sociology, aims to promote the academic study of different facets of criminal justice organizations and practices, including the legal, political and social contexts in which they operate. This program would be beneficial to individuals with a scholarly interest in acts and behaviours defined and viewed as deviant and/or illegal, as well as in social and legal justice, policing, corrections, law enforcement, rehabilitative supports and services, and justice/legal system themes more broadly. Those who have completed the diploma in police studies; experienced police, correctional, probation, or parole officers; and others working in a policing, correctional, or justice system environment may also be interested in pursuing a degree in criminology. The major in criminology does not constitute a qualification in policing or corrections.",
    "desc": "The criminology major promotes critical thinking about the legal, political, and social influences that impact crime and society, and our justice/legal system. This program would be beneficial if you have a scholarly interest in policing, the courts, corrections, or another facet of the justice system. Our faculty work closely with our local, national, and international communities and we offer many courses through distance learning to specifically respond to the demands of social/justice system work.",
    "requirements": "<p>You may apply for admission into the Faculty of Arts, Humanities and Social Sciences by indicating bachelor of arts as your program choice on the undergraduate application for admission. Direct entry into the faculty is subject to your meeting the general admission requirements.</p><p>You may choose criminology as your major at the time of application or you can explore your options and declare a major in a later semester by emailing us to make your choice official.</p>",
    "career": "<p>A bachelor of arts degree, with a major in criminology, prepares students for a variety of careers and fields including:</p><ul><li>community/social service worker</li><li>counsellor</li><li>court liaison</li><li>court reporter</li><li>criminologist</li><li>insurance or fraud investigator</li><li>law</li><li>loss prevention officer</li><li>police officer or law enforcement officer (e.g., correctional, probation, parole, border services, immigration)</li><li>private security</li><li>policy analyst</li><li>social worker</li><li>victim services</li><li>youth support worker</li></ul><p><strong>Note:</strong> some of these careers may call for supplementary education or preparation in the form of graduate studies, experiential learning or professional courses and exams.</p>",
    "program": { "undergraduate": "Bachelor of Arts (B.A.)" },
    "qualification": { "undergraduate": "Bachelor's degree (Undergruaduate)" },
    "duration": { "undergraduate": "4 years" }
  },
  {
    "slug": "sata-science",
    "name": "Data Science",
    "department": "Computer Science",
    "faculty": "Science",
    "degree": { "postgraduate": "MSc" },
    "excerpt": "<p>Data science is one of the most sought-after professions of the 21st century. With lives increasingly being lived online, nearly every individual leaves behind a data trail that is as valuable as gold in this digital age.</p><p>With this increasing generation of data, there is also an ever-increasing demand for specialists who are able to structure, analyse and process it. This work is done by data scientists.</p><p>Given the continuing demand for data scientists, and the expected accelerated growth of this profession over the next few decades, we have developed the Master of Data Science (MSc). Jointly offered by the Departments of Mathematics and Statistics and Computer Science, it is a one-year program aiming to equip students with the foundations of data science and provide them with practical techniques needed to effectively translate data into knowledge, communicate the findings, and help in the decision-making process.</p>",
    "desc": "The Master of Data Science is a one-year program, consisting of ten courses, plus a case study series and a capstone project.",
    "requirements": "Bachelor's degree (minimum second class); applicants should have at least one college-level course or equivalent knowledge in each of the following areas: multivariate calculus, statistical inference, and computer programming (in a high-level programming language, such as R, Python, C, C++, Java, etc.)",
    "career": "<p>After completing the MSc program, a graduate shall be able to:</p><ul><li>Develop an in-depth understanding of data science methods and techniques in predictive modelling, machine learning, artificial intelligence, data visualisation, and mining of big data.</li><li>Build the skills to explore, analyse, and visualise data sets, regardless of their size, using the latest technologies.</li><li>Apply data science and analytical methods to address data-rich problems from a variety of fields, think critically about data, and drive decision-making.</li></ul>",
    "program": { "postgraduate": "Master of Science (M.Sc.)" },
    "qualification": {
      "postgraduate": "Master's degree (Postgruaduate taught)"
    },
    "duration": { "postgraduate": "1 year" }
  },
  {
    "slug": "dental-hygiene-and-therapy",
    "name": "Dental Hygiene and Therapy",
    "department": "Dentistry",
    "faculty": "Health and Medicine",
    "degree": { "undergraduate": "BSc" },
    "excerpt": "On this three-year degree programme, you will study alongside, and be integrated with, the BDS students, which fosters a team approach to patient care. You will learn the skills and knowledge that are required for you to register with the General Dental Council as a dental therapist or hygienist upon graduation.",
    "desc": "<p>This is a relatively new programme within the Faculty of Health and Medicine. </p><p>Our aim is to assist students to acquire the skills, knowledge and attitudes that are necessary to practice as a dental care professional in the 21st century. </p>",
    "requirements": "Direct entry into the program from high school is subject to meeting the general admission, including appropriate courses in Chemistry, Biology and a laboratory science. ",
    "career": "<ul><li>Dental Hygienist</li><li>Dental public health</li><li>Oral and maxillofacial pathology</li><li>Oral microbiology</li></ul>",
    "program": { "undergraduate": "Bachelor of Science (B.Sc.)" },
    "qualification": { "undergraduate": "Bachelor's degree (Undergruaduate)" },
    "duration": { "undergraduate": "4 years" }
  },
  {
    "slug": "dental-surgery",
    "name": "Dental Surgery",
    "department": "Dentistry",
    "faculty": "Health and Medicine",
    "degree": {
      "undergraduate": "BDS",
      "postgraduate": "MSc",
      "research": "PhD"
    },
    "excerpt": "The course has been designed to equip you with a broad knowledge of all relevant aspects of Health and Medicine and the application of this knowledge to the diagnosis, prevention and treatment of oral and dental diseases and abnormalities.",
    "desc": "<ul><li>BDS - The Bachelor of Dental Surgery (BDS) degree is a five year programme in the UK for undergraduate entry. We run a graduate entry pathway which allows for direct entry into year 2 and the programme is then completed in four years.<br>With only 40 places available each year, applicants must demonstrate that their prior formal qualifications have covered relevant biomedical subjects.<br>Within the programme students undertake both academic study and practical patient care. Patient care is introduced early and under close supervision from experienced clinicians. 100% of our graduates have gone on to find employment after graduation.</li><li>MSc - We offer a MSc in Special Care Dentistry and MSc in Advanced Restorative Dental Practice.</li><li>PhD - We offer PhD and Research opportunities</li></ul>",
    "requirements": "<ul><li>BDS - Direct entry into the program from high school is subject to meeting the general admission, including appropriate courses in Chemistry, Biology and a laboratory science.</li><li>MSc - Bachelor's degree in Dentistry or it's equivalent</li><li>PhD - Master's degree in Dentistry or it's equivalent</li></ul>",
    "career": "<ul><li>Dental and maxillofacial radiology</li><li>Dental public health</li><li>Oral and maxillofacial pathology</li><li>Oral medicine</li><li>Oral microbiology</li><li>Oral surgery</li><li>Orthodontics</li><li>Paediatric dentistry</li><li>Restorative dentistry</li><li>Special care dentistry</li><li>Oral and maxillofacial surgery</li><li>Academic dentistry</li></ul>",
    "program": {
      "undergraduate": "Bachelor of Dental Surgery (BDS)",
      "postgraduate": "Master of Science (M.Sc.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "doctor-of-medicine",
    "name": "Doctor of Medicine",
    "department": "Medicine",
    "faculty": "Health and Medicine",
    "degree": { "undergraduate": "MD" },
    "excerpt": "The doctor of medicine (MD) program is a four-year undergraduate degree program which prepares students to begin residency training. Upon successful completion of the MD program, students are eligible to apply to post-graduate medical education programs.",
    "desc": "<p>Designed for students who have completed their undergraduate studies and are committed to professional training, the MD program supports both the personal and professional development of each individual. The redesigned course aims to produce high quality medical professionals who can thrive in complex environments and be the leaders of change.</p><p>It delivers advanced clinical and academic training to ensure students are prepared for the challenges of internship and an increasingly diverse medical career. With an emphasis on choice and customisation, the MD program allows students to build their own future.</p>",
    "requirements": "A bachelor's degree in any discipline from an accredited post-secondary institution",
    "career": "<ul><li>Physician</li><li>Physician assistant</li><li>Pharmacist</li><li>General practitioner</li><li>Medical assistant</li><li>Internal medicine</li><li>Surgeon</li><li>Dentist</li><li>Anesthesiologist</li><li>Pharmacy</li><li>Nursing Assistant</li><li>Medical laboratory scientist</li><li>Occupational Therapist</li><li>Veterinarian</li><li>Podiatrist</li><li>Pharmacy Technicians</li><li>Physical Therapist</li><li>Respiratory Therapists</li><li>Psychiatrist</li><li>Registered Nurse</li><li>Emergency medicine</li><li>Dentistry</li><li>Anesthesiology</li></ul>",
    "program": { "undergraduate": "Doctor of Medicine (M.D.)" },
    "qualification": { "undergraduate": "Bachelor's degree (Undergruaduate)" },
    "duration": { "undergraduate": "4 years" }
  },
  {
    "slug": "doctor-of-pharmacy",
    "name": "Doctor of Pharmacy",
    "department": "Pharmacy",
    "faculty": "Health and Medicine",
    "degree": { "undergraduate": "DPharm" },
    "excerpt": "The entry-to-practice doctor of pharmacy (Pharm.D.) program is designed to prepare students who are beginning their pharmacy education for careers primarily in community and hospital settings, as well as pharmaceutical industries, pharmacy organizations, and educational environments.",
    "desc": "The Doctor of Pharmacy (Pharm.D.) program can be completed in four years of full-time study. A graduate of the program will be eligible to apply to be licensed as a pharmacist across UK after successful completion of provincial and national examinations.",
    "requirements": "Admission from high school is subject to meeting the general admission requirements, including appropriate courses in mathematics and a laboratory science",
    "career": "<p>Upon completion of the Pharm.D. program, pharmacy graduates have many exciting opportunities for beginning their careers, including a variety of practice settings. Some career choices include:</p><ul><li>Community pharmacy</li><li>Hospital pharmacy</li><li>Academia</li><li>Pharmaceutical industry</li><li>Government</li><li>Pharmacy associations</li></ul>",
    "program": { "undergraduate": "Doctor of Pharmacy (D.Pharm.)" },
    "qualification": { "undergraduate": "Bachelor's degree (Undergruaduate)" },
    "duration": { "undergraduate": "4 years" }
  },
  {
    "slug": "earth-sciences",
    "name": "Earth sciences",
    "department": "Earth sciences",
    "faculty": "Science",
    "degree": {
      "undergraduate": "BSc",
      "postgraduate": "MSc",
      "research": "PhD"
    },
    "excerpt": "Earth sciences encompasses all scientific studies related to the structure and development of our planet, whether investigating the composition of rocks or soil on the Earth’s surface, the movement of plates or the properties of material far beneath our feet. Although field work plays an important role in many studies, today’s geoscientists commonly use ocean drilling vessels, satellite imagery, high-precision geochemical and geophysical instruments, and the latest in electronic and laser microscopes.",
    "desc": "<p>We have one of the largest and most diverse Earth sciences departments in Scotland. You can choose a comprehensive stream, or specialize in applied geophysics; environmental geoscience; petrology, tectonics and economic geology; or sedimentary basins.</p><p>Many companies visit us annually to hire our students both for summer work and permanent positions. A significant proportion of our students become professional geoscientists.</p>",
    "requirements": "<p>You may apply for admission into the Faculty of Science by indicating bachelor of science as your program choice on the application for admission.</p><p>Direct entry into the Faculty of Science from high school is subject to meeting the general admission requirements, including appropriate courses in mathematics and a laboratory science.</p>",
    "career": "<p>A degree in Earth sciences prepares students for a variety of careers including:</p><ul><li>environmental geoscientist</li><li>mineralogist</li><li>gemologist</li><li>planetary scientist</li><li>teacher</li><li>museum curator</li><li>park interpreter</li><li>paleontologist</li></ul><p><strong>Note:</strong> some of these careers may call for supplementary education or preparation in the form of graduate studies, experiential learning or professional courses and exams.</p>",
    "program": {
      "undergraduate": "Bachelor of Science (B.Sc.)",
      "postgraduate": "Master of Science (M.Sc.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "economics",
    "name": "Economics",
    "department": "Economics",
    "faculty": "Business",
    "degree": {
      "undergraduate": "BSc",
      "postgraduate": "MSc",
      "research": "PhD"
    },
    "excerpt": "Economics is a versatile field that deals with the analysis and management of production, distribution and consumption of goods and services. Economics gives us the analytical tools to understand questions such as how prices are determined, why some people are unemployed, why interest rates rise and fall, and why product is traded between nations.",
    "desc": "<p>We offer major, minor and honours programs leading to either a bachelor of science (B.Sc.) in economics.</p><p>We also offer applied economics courses in a wide variety of areas, including fishery, petroleum and mining, forestry, environmental, development, international, monetary, public sector, welfare, labour and health economics.</p><p>Students who study economics can choose to complete the major as part of a bachelor of science degree.</p>",
    "requirements": "<ul><li>BSc - Direct entry into the Faculty of Business from high school is subject to meeting the general admission, including appropriate courses in mathematics.</li><li>MSc - Bachelor degree (major in Economics) with a minimum average of 75% overall (international applicants are strongly encouraged to submit a valid GRE score report)</li><li>PhD - Master's degree in an appropriate area of study (international applicants are strongly encouraged to submit a valid GRE score report)</li></ul>",
    "career": "<p>Our graduates have gone on to careers in:</p><ul><li>business</li><li>finance and banking</li><li>law</li><li>accounting</li><li>private consulting</li><li>real estate</li><li>insurance and actuarial work</li><li>social enterprises</li><li>private sector (oil and gas, utilities and mining)</li><li>non-governmental organizations</li><li>providing economic research and economic analysis for governments at the federal, provincial and municipal levels</li></ul>",
    "program": {
      "undergraduate": "Bachelor of Science (B.Sc.)",
      "postgraduate": "Master of Science (M.Sc.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "education",
    "name": "Education",
    "department": "Education",
    "faculty": "Education",
    "degree": {
      "undergraduate": "BEd",
      "postgraduate": "MEd",
      "research": "PhD"
    },
    "excerpt": "The Faculty of Education offers a range of undergraduate programs, using a combination of delivery modes, technology and innovative approaches to prepare teachers for careers in the K-12 school system and a variety of adult learning settings. Our programs are designed to prepare new teachers to create exceptional learning environments for their students, to meet the diverse needs of learners, and to engage in critical inquiry about their teaching practice.",
    "desc": "The Faculty of Education is responsible for the professional preparation of those who will give leadership in education. This includes the professional preparation of teachers, administrators, and specialists who will work in primary, elementary, and secondary schools, and post-secondary institutions. The work of the faculty incorporates undergraduate and graduate studies, as well as continuing education. The mandate includes specialized research for the improvement of pedagogical practice, and broadly based research for the advancement of knowledge. The faculty initiates and responds to change through a wide range of programs and a variety of field services. It seeks to prepare educators who will have a reasoned philosophy of education, an appreciation of what knowledge is of most worth, a genuine love of learning, and the ability to think critically. It strives to prepare educators who have an understanding of the past, a plan for the present, and a vision for the future.",
    "requirements": "<ul><li><li>BEd - Direct entry into the Faculty of Education from high school is subject to meeting the general admission.</li>MEd - Bachelor's degree (minimum second class or 70% average in last 30 attempted courses).</li><li>PhD - Master's Degree in Education ('A' standing) or an equivalent Master's Degree from an accredited university; evidence of scholarly work; and two years of professional experience in an educational setting. An interview may also be required.</li></ul>",
    "career": "Student affairs/services positions (advisor, manager, director positions in Admissions, Registrar's Office, Financial Aid, Student Recruitment, Health and Wellness, Residence Life); vocational, college, and university lecturers/instructors; educational developers; instructional/educational technologies designers; administrative positions at vocational, college and university institutions.",
    "program": {
      "undergraduate": "Bachelor of Education (B.Ed.)",
      "postgraduate": "Master of Education (M.Ed.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "electrical-engineering",
    "name": "Electrical Engineering",
    "department": "Electrical Engineering",
    "faculty": "Engineering and Applied Science",
    "degree": {
      "undergraduate": "BEng",
      "postgraduate": "MEng",
      "research": "PhD"
    },
    "excerpt": "Electrical engineering is a fast-changing and diverse discipline concerned with the analysis, design, and manufacture of a huge variety of devices, systems, and processes involving electricity. It deals with the transfer of electrical energy and information.",
    "desc": "The electrical engineering program includes a mandatory, integrated co-operative education program in which students gain up to two years of practical work experience. You will take courses in hardware, electromagnetics, power systems, electric machines, communications, computer programming and control systems. You will participate in design projects throughout the program, including a team capstone design project in your final year that may span electrical and computer engineering and involve students from both majors.",
    "requirements": "<p>An engineering degree in electrical engineering, prepares students for a variety of careers including:</p><ul><li>electrical systems design engineer</li><li>communications engineer</li><li>electrical systems planning engineer</li><li>control system designers</li></ul>",
    "career": "<ul><li>BEng - To apply for admission into the Faculty of Engineering and Applied Science, indicate bachelor of engineering in the appropriate place on the undergraduate application for admission. In addition to meeting the general admission requirements, you will also need to meet the admission requirements set out by the Faculty of Engineering and Applied Science.</li><li>MEng - Bachelor's degree (minimum second class or &lsquo;B' standing) in an appropriate area of study</li><li>PhD - Master's degree in an appropriate area of study (applicant's rank in class, referees' assessments, general performance through previous academic programs, and availability of supervisors will all be considered)</li></ul>",
    "program": {
      "undergraduate": "Bachelor of Engineering (B.Eng.)",
      "postgraduate": "Master of Engineering (M.Eng.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "english",
    "name": "English",
    "department": "English",
    "faculty": "Arts, Humanities and Social Sciences",
    "degree": {
      "undergraduate": "BA",
      "postgraduate": "MA",
      "research": "PhD"
    },
    "excerpt": "The study of English focuses on two activities - reading and writing. In some courses, students may concentrate on writing. In others, the emphasis will be on reading and interpretation. But rarely are reading and writing separated. A degree in English is invaluable training in how language works.",
    "desc": "<p>In the Department of English you will encounter ideas, both new and old, and texts, both experimental and traditional. You will read some of the best works in literature and culture, and you will engage in provocative conversations about meaning, literary history, the future, your identity and your place in the world. All of our programs are designed to help you think critically, read closely, and write effectively.</p><p>The Department of English offers select courses such as live theatre, literary landscapes, social justice in the arts: you can find all that and more across the pond at Harlow.</p>",
    "requirements": "<ul><li>BA - You may apply for admission into the Faculty of Arts, Humanities and Social Sciences by indicating bachelor of arts as your program choice on the undergraduate application for admission. Direct entry into the faculty is subject to your meeting the general admission requirements.</li><li>MA - The MA program offers both course and thesis options. The course option can be completed in one year of full-time study while the thesis option can be completed in two years.</li></ul><ul><li>PhD - The PhD program involves courses, a comprehensive exam, and a thesis. It can normally be completed in four years of full-time study.</li></ul>",
    "career": "<p>An English degree is good preparation for further education and virtually any career as it teaches critical thinking and skilled communication. A few employment areas:</p><ul><li>print and digital journalism</li><li>media and publishing</li><li>editing and proofreading</li><li>advertising, marketing and public relations</li><li>teaching and education</li></ul><p><strong>Note:</strong> some of these careers may call for supplementary education or preparation in the form of graduate studies, experiential learning or professional courses and exams.</p>",
    "program": {
      "undergraduate": "Bachelor of Arts (B.A.)",
      "postgraduate": "Master of Arts (M.A.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "environment-and-sustainability",
    "name": "Environment and Sustainability",
    "department": "Environment Science",
    "faculty": "Science",
    "degree": {
      "undergraduate": "BSc",
      "postgraduate": "MSc",
      "research": "PhD"
    },
    "excerpt": "Environment and SustainabilityUndergraduate Programssubnav iconMoreDecrease Text Size Default Text Size Increase Text Size Print Link Share LinkThe Environment and Sustainability program bridges scientific concerns about natural resources with policy development and management. The four-year degree program offers two majors, one in Environmental Studies and one in Resource Management.",
    "desc": "<p>We depend on the environment for many aspects of our daily lives, including food, employment, recreation, and natural resources for homes, transportation and consumer goods. Future generations will have a similar dependence on the environment as we do now; it is our responsibility to ensure that they way we use resources now does not impact access to those same resources by future generations.</p><p>This Environment and Sustainability equips students with the tools and critical thinking skills necessary to make decisions regarding how we use the environment now with a view to future generations. Students in each Environment and Sustainability major take a common set of courses through out the four years of the program. Environmental Studies majors take an additional set of courses from a social science perspective (such as economics, political science, geography) whereas Resource Mangement majors take as set of courses have an ecological or science based perspective (such as geographic information systems, population and resource dynamics, and quantitative methods).</p><p>Environment and Sustainability is ideal for students who are looking to design solutions that meet the needs of current society without jeopardizing the quality and quantity of resources for the future. Students take a holistic approach, exploring ethics, ecology, economics, geography, risk, activism and policy, examining issues through both local and global lenses.</p>",
    "requirements": "<ul><li>BSc - Direct entry into the Faculty of Science from high school is subject to meeting the general admission, including appropriate courses in mathematics and a laboratory science. </li><li>MSc - Bachelor degree an appropriate area of study with a minimum average of 65%</li></ul><ul><li>PhD - Master's degree in an appropriate area of study </li></ul>",
    "career": "<p>Our graduates are recognized and are working globally in a wide range of fields:</p><ul><li>Resource management, in the public service or private industry</li><li>Environmental policy development and planning</li><li>Consulting</li><li>Environmental education</li><li>Journalism</li><li>Research</li><li>Non-governmental organizations</li></ul><p>Graduates are also well prepared for advanced studies in:</p><ul><li>Resource management</li><li>Geography</li><li>Environmental studies</li><li>Environmental policy</li><li>Sustainability science</li><li>Geographical Information Systems</li></ul>",
    "program": {
      "undergraduate": "Bachelor of Science (B.Sc.)",
      "postgraduate": "Master of Science (M.Sc.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "environmental-humanities",
    "name": "Environmental Humanities",
    "department": "Philosophy",
    "faculty": "Arts, Humanities and Social Sciences",
    "degree": { "undergraduate": "BA", "postgraduate": "MA" },
    "excerpt": "If you are interested in environmental issues and ideas, then the degree in environmental humanities is a great opportunity for you. In recent years, scholars in the environmental humanities have argued that studying the environmental idea, politics, and culture are equally important to addressing environmental issues as the sciences. The degree in environmental humanities offers you a chance to study the environmental issues and ideas through a range of subjects including, philosophy, history, geography, religion, sociology and anthropology.",
    "desc": "The degree is a relatively brief program, comprised of 27 credit hours (or nine courses). It will serve as an excellent foundational program for BA students who are looking for an environmental focus in their degree, for BSc students who are interested in environmental issues, for professionals in NGOs and government who are looking to augment their knowledge of environmental issues, or for members of the general public interested in learning about the subject outside of a degree program. The diploma will be of interest to any students who wish to work in the broad field of environment after graduation.",
    "requirements": "Direct entry into the Faculty of Arts, Humanities and Social Sciences from high school is subject to meeting the general admission.",
    "career": "The degree will be of interest to any students who wish to work in the broad field of professionals in NGOs and government after graduation.",
    "program": {
      "undergraduate": "Bachelor of Arts (B.A.)",
      "postgraduate": "Master of Arts (M.A.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)"
    },
    "duration": { "undergraduate": "4 years", "postgraduate": "1 year" }
  },
  {
    "slug": "environmental-physics",
    "name": "Environmental Physics",
    "department": "Physics",
    "faculty": "Science",
    "degree": {
      "undergraduate": "BSc",
      "postgraduate": "MSc",
      "research": "PhD"
    },
    "excerpt": "Environmental physics explores the Earth’s environment through the understanding provided by physics. It draws upon the ideas and concepts from many different areas of physics including mechanics, electricity, magnetism, thermodynamics and atomic physics.",
    "desc": "Many of our studies are actively involved in physics research programs. This experience provides both summer employment and an excellent preparation for a career in industrial or university research. We are the only British university offering physics with an environmental focus.",
    "requirements": "<ul><li>BSc - Direct entry into the Faculty of Science from high school is subject to meeting the general admission, including appropriate courses in mathematics and a laboratory science. </li><li>MSc - Bachelor degree an appropriate area of study with a minimum average of 65%</li></ul><ul><li>PhD - Master's degree in an appropriate area of study </li></ul>",
    "career": "<p>A degree in physics, prepares students for a variety of careers including:</p><ul><li>geophysics industry</li><li>manufacturing</li><li>product tester</li><li>environmental scientist</li><li>policy and data analyst</li><li>environmental planner</li><li>environmental scientist</li></ul>",
    "program": {
      "undergraduate": "Bachelor of Science (B.Sc.)",
      "postgraduate": "Master of Science (M.Sc.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "environmental-science",
    "name": "Environmental Science",
    "department": "Environmental science",
    "faculty": "Science",
    "degree": {
      "undergraduate": "BSc",
      "postgraduate": "MSc",
      "research": "PhD"
    },
    "excerpt": "The environmental science program focuses on applying natural sciences to better understand the environment. Program courses explore a science-based focus on the environment that extends from chemical reactions to ecosystem functions in response to human modification of the world around us.",
    "desc": "<p>Our Environmental Science programs are interdisciplinary in nature and offered by the Faculty of Science. Students enter the Environmental Science programs from a wide range of undergraduate science backgrounds, including the bachelor's program in Environmental Science. Our graduate programs give students an opportunity to build upon their undergraduate science education, to investigate its environmental relevance, to see how it relates to other scientific disciplines important in Environmental Science, and to learn more about these other disciplines.</p><p>There are two ways to complete a graduate degree in Environmental Science: one is a research-intensive program leading to the degree of Master of Science (Environmental Science), and the other is the research-based PhD.</p>",
    "requirements": "<ul><li>BSc - Direct entry into the Faculty of Science from high school is subject to meeting the general admission, including appropriate courses in mathematics and a laboratory science. </li><li>MSc - Bachelor's degree (minimum second class) in Science, Geography, Environmental Science, Engineering or equivalent</li></ul><ul><li>PhD - Master's degree in an appropriate area of study </li></ul>",
    "career": "<p>Graduates of the environmental science program can enter a number of different fields; review these categories to learn more about the types of careers you might pursue:</p><ul><li>Government</li><li>Higher education</li><li>Agencies and organizations</li></ul>",
    "program": {
      "undergraduate": "Bachelor of Science (B.Sc.)",
      "postgraduate": "Master of Science (M.Sc.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "environmental-systems-engineering",
    "name": "Environmental Systems Engineering",
    "department": "Environmental Systems Engineering",
    "faculty": "Engineering and Applied Science",
    "degree": { "postgraduate": "MEng" },
    "excerpt": "Environmental engineering has become an increasingly important discipline due to complexity and multi-disciplinary nature of the environmental issues dealing with human health and ecosystem protection. To find cost-effective engineering solutions to these complex issues, it is important to acquire broad-based education and professional training in inter-disciplinary fields of physical, chemical and biological principles, resource management and mitigation measures besides in-depth knowledge in environmental engineering. This course-based program will cover a wide range of related topics, such as environmental law and management; human health and ecological risk assessment; remediation technology; treatment processes of drinking water and wastewater; contaminant transport and environmental modeling; environmental sampling; and pollution-control engineering. To apply the concepts learned in the classroom and laboratory environments, students will work in teams on an engineering project for two terms. In order to acquire broad-based knowledge in the field, students will be encouraged to take courses from other disciplines in the university.",
    "desc": "The program can be completed on a full- or part-time basis. The duration of the full-time program is normally 1 year.",
    "requirements": "To be considered for admission to the MEng in environmental systems engineering program, the minimum requirements will normally be a second-class degree in environmental engineering, civil engineering, mechanical enginerering, applied chemistry, or other relevant area of study from a university of recognized standing.",
    "career": "<p>Environmental Systems Engineering should appeal to students with a wide variety of career goals. Graduates can:</p><ul><li>Focus on urban infrastructure design and renewal, as consulting engineers</li><li>Go on to graduate school, for example in civil and environmental engineering, or in scientific fields such as hydrology and oceanography</li><li>Work for NGOs and foundations focusing on solving environmental challenges (and perhaps ultimately go on to law or business school)</li></ul>",
    "program": { "postgraduate": "Master of Engineering (M.Eng.)" },
    "qualification": {
      "postgraduate": "Master's degree (Postgruaduate taught)"
    },
    "duration": { "postgraduate": "1 year" }
  },
  {
    "slug": "film-studies",
    "name": "Film studies",
    "department": "English",
    "faculty": "Arts, Humanities and Social Sciences",
    "degree": { "undergraduate": "BA" },
    "excerpt": "Film studies is an academic discipline that deals with various theoretical, historical, and critical approaches to cinema as an art form and a medium.",
    "desc": "The bachelor in film studies is designed for those who are interested in film as a form of cultural production that spans the globe. The program acquaints students with film as form before exploring how it is deployed in multiple settings and how it evolves depending on political, social, historical, economic, and technological contexts.",
    "requirements": "Direct entry into the BA Film studies from high school is subject to meeting the general admission",
    "career": "<ul><li>Broadcast presenter</li><li>Film director</li><li>Film/video editor</li><li>Location manager</li><li>Production designer, theatre/television/film</li><li>Programme researcher, broadcasting/film/video</li><li>Runner, broadcasting/film/video</li><li>Television camera operator</li><li>Television/film/video producer</li><li>Television production coordinator</li></ul>",
    "program": { "undergraduate": "Bachelor of Arts (B.A.)" },
    "qualification": { "undergraduate": "Bachelor's degree (Undergruaduate)" },
    "duration": { "undergraduate": "4 years" }
  },
  {
    "slug": "fine-arts",
    "name": "Fine Arts",
    "department": "Fine Arts",
    "faculty": "Arts, Humanities and Social Sciences",
    "degree": { "undergraduate": "BFA", "postgraduate": "MFA" },
    "excerpt": "Fine Arts is a terminal degree, including visual arts, creative writing, graphic design, photography, filmmaking, dance, theatre, performing arts, theatre management and arts administration.",
    "desc": "Guided by our active faculty and progressive model for learning, we provide a flexible course of study tailored to the student’s individual area of research, incorporating both critical theory and practice-based research. Students have access to studios, research facilities, and faculty across a range of disciplines within the Visual Arts program and beyond through the broad University network.",
    "requirements": "<ul><li>BA - Direct entry into the Faculty of Arts, Humanities and Social Sciences from high school is subject to meeting the general admission</li><li>MA - Bachelor's degree in fine arts (B average or higher) or equivalent professional visual arts experience; portfolio of 20 images of examples of work or other documentation of visual art research</li></ul>",
    "career": "Professional artist, curator, gallery director, art instructor, designer, art administration",
    "program": {
      "undergraduate": "Bachelor of Fine Arts (B.FA.)",
      "postgraduate": "Master of Fine Arts (M.FA.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)"
    },
    "duration": { "undergraduate": "4 years", "postgraduate": "1 year" }
  },
  {
    "slug": "fisheries-science",
    "name": "Fisheries Science",
    "department": "Fisheries",
    "faculty": "Science",
    "degree": {
      "undergraduate": "BSc",
      "postgraduate": "MSc",
      "research": "PhD"
    },
    "excerpt": "<p>The degree in Fisheries Science is a full time program, aimed at those who want to participate in the development of new fisheries science knowledge.</p><p>Fisheries researchers will be equipped with a national and internationally demanded skill set that focuses on quantitative analysis, science communication and knowledge in the management and practice of North Atlantic fisheries.</p>",
    "desc": "<p>This program recognizes that fisheries science is a broad discipline that is applied in nature and requires a high degree of skills to be done well. Students will gain practical skills through coursework while developing their theoretical understanding through supervised research and through their interactions as an active participant within the scientific community.</p><p>Students will also be exposed to the depth of the field of fisheries science through lab meetings, reading groups and guest lectures.</p>",
    "requirements": "<ul><li>BSc - Direct entry into the Faculty of Science from high school is subject to meeting the general admission, including appropriate courses in mathematics and a laboratory science. </li><li>MSc - Bachelor's degree (minimum second class) in Science Engineering or equivalent</li><li>PhD - normally restricted to candidates holding a Master's degree or its equivalent. In exceptional circumstances.</li></ul>",
    "career": "Academia, government agencies, NGOS, international management bodies, seafood industry.",
    "program": {
      "undergraduate": "Bachelor of Science (B.Sc.)",
      "postgraduate": "Master of Science (M.Sc.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "food-safety",
    "name": "Food Safety",
    "department": "Food Science",
    "faculty": "Science",
    "degree": { "postgraduate": "MSc" },
    "excerpt": "The program places an emphasis on the food quality assurance component of the industry. It's designed to provide a strong technical education in food safety and food inspection.",
    "desc": "<p>Courses feature a combination of lectures, workshops, practical sessions, guest lecturers and projects to hone your practical and technical skills. Your work term placement will provide you invaluable practical experience that will help you become an asset to the industry.</p><p>This one-year program is comprised of two in-class semesters and one work term placement.</p>",
    "requirements": "<p>Candidates for admission to the MSc in Food Safety must be graduates of an appropriate diploma of science or technology (three (3) years duration), or a bachelor degree, or a combination of work experience and formal education acceptable to the Admissions Committee, and have completed introductory courses in biology and chemistry.</p>",
    "career": "Focuses on how the food industry is managed and regulated and provides solid career skills for the manufacturing and processing side of the industry",
    "program": { "postgraduate": "Master of Science (M.Sc.)" },
    "qualification": {
      "postgraduate": "Master's degree (Postgruaduate taught)"
    },
    "duration": { "postgraduate": "1 year" }
  },
  {
    "slug": "food-science",
    "name": "Food Science",
    "department": "Food Science",
    "faculty": "Science",
    "degree": {
      "undergraduate": "BSc",
      "postgraduate": "MSc",
      "research": "PhD"
    },
    "excerpt": "Food Science is a multi-disciplinary field involving chemistry, biochemistry, nutrition, microbiology and engineering to give one the scientific knowledge to solve real problems associated with the many facets of the food system. The basis of the discipline lies in an understanding of the chemistry of food components, such as proteins, carbohydrates, fats and water and the reactions they undergo during processing and storage. A complete understanding of processing and preservation methods is required including drying, freezing, pasteurization, canning, irradiation, extrusion, to name just a few. The ability to carry out analysis of food constituents is developed along with statistical quality control methods. The microbiology and the safety aspects of food must also be understood. Other topics covered include food additives, the physico-chemical properties of food, flavor chemistry, product development, food engineering and packaging. Food science integrates this broad-based knowledge and focuses it on food.",
    "desc": "Food Science is still a relatively new and growing discipline, brought about mainly as a response to the social changes taking place in North America and other parts of the developed world. The food industry, which originally provided only primary products for final preparation in the home, finds itself responding to market demands for more refined, sophisticated, and convenient products. The demand for easy to prepare, convenience foods, poses major scientific and technological challenges which cannot be met without highly trained scientists capable of understanding the complex chemistry/biochemistry of food systems and knowledge of the methods to preserve them. This increased reliance of society on ready-to-eat foods has led to greater responsibility for processors in terms of quality, safety and nutrition. In order to ensure high quality and competitive products, scientific principles and new technologies are being applied to food manufacturing and the body of knowledge required has become that discipline called Food Science.",
    "requirements": "<ul><li>BSc - Direct entry into the Faculty of Science from high school is subject to meeting the&amp;nbsp;general admission, including appropriate courses in mathematics and a laboratory science.</li><li>MSc - Bachelor's degree (minimum second class) in an appropriate area of study</li></ul><ul><li>PhD - Master's degree in an appropriate area of study </li></ul>",
    "career": "<ul><li>Food Product or Ingredient Development Scientist</li><li>Sensory Scientist</li><li>Food Microbiologist or Food Safety Expert</li><li>Food Chemist</li><li>Food Process and Packaging Design Engineer</li><li>Quality Control Supervisor</li><li>Food Plant Production Supervisor or Manager</li></ul>",
    "program": {
      "undergraduate": "Bachelor of Science (B.Sc.)",
      "postgraduate": "Master of Science (M.Sc.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "french",
    "name": "French",
    "department": "French",
    "faculty": "Arts, Humanities and Social Sciences",
    "degree": {
      "undergraduate": "BA",
      "postgraduate": "MA",
      "research": "PhD"
    },
    "excerpt": "The French language is more than a thousand years old and has created one of Europe's greatest cultures. Much of the world's finest philosophy, cinema, history, science and literature are in French. French is one of UK's official languages and is indispensable for anyone seeking a national career in any field. Having a second (or third!) language is a huge asset in an increasingly competitive global marketplace.",
    "desc": "<p>All students majoring in French are required to participate in an immersion experience. Study abroad opportunities include the Frecker Program in Nice, the Universit&eacute; de Bretagne Sud and other opportunities to work/study in a francophone milieu.</p><p>The Frecker program is a total immersion program in St. Pierre-et-Miquelon where students will enrol in five French courses at the 2000 level and live with a French family. The program is offered every Fall semester and in July (FREN 2300 and 2900).</p>",
    "requirements": "<ul><li>BA - Direct entry into the Faculty of Arts, Humanities and Social Sciences from high school is subject to meeting the general admission. </li><li>MA - Bachelor's degree in an appropriate area of study </li></ul><ul><li>PhD - Master's degree in an appropriate area of study </li></ul>",
    "career": "<p>In the 21st century, the ability to communicate at the international level is an essential skill that is greatly valued in several areas including:</p><ul><li>education (translation, research, teaching, library work, graduate studies)</li><li>business and industry (banking, journalism, export/import, advertising, publishing)</li><li>social work (police work, health sector, courts)</li><li>government services (customs, civil service, external affairs, immigration)</li></ul>",
    "program": {
      "undergraduate": "Bachelor of Arts (B.A.)",
      "postgraduate": "Master of Arts (M.A.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "Gender-studies",
    "name": "Gender Studies",
    "department": "Gender Studies",
    "faculty": "Arts, Humanities and Social Sciences",
    "degree": {
      "undergraduate": "BA",
      "postgraduate": "MA",
      "research": "PhD"
    },
    "excerpt": "<p>The gender studies major offers you the opportunity to explore gender in society. It addresses gender and gender relations and practical tools for promoting equality.</p><p>Gender studies courses lead to new knowledge and understanding and provide a critical edge for thinking about everyday situations (such as literature, advertisements and reality television), current events (such as political conflicts), and always changing social and political issues (such as the movement of people, products and money across borders). </p><p>In addition to being a discipline in itself, gender studies is an important area of study in disciplines such as literary theory, drama studies, film studies, religious studies, performance theory, art history, anthropology, sociology and psychology.</p>",
    "desc": "Gender studies allows you to develop a framework for thinking about power relations connected to social constructions of gender, race, class, sexuality, ability, age and nationality through multiple perspectives and theories.",
    "requirements": "<ul><li>BA - Direct entry into the Faculty of Arts, Humanities and Social Sciences from high school is subject to meeting the general admission. </li><li>MA - Bachelor's degree in an appropriate area of study </li></ul><ul><li>PhD - Master's degree in an appropriate area of study </li></ul>",
    "career": "<p>A gender studies degree is good preparation for careers that require the skills of critical analysis and data synthesis such as:</p><ul><li>law</li><li>public service</li><li>social work</li><li>diplomacy</li><li>international development</li><li>police work</li><li>non-profit organizations</li><li>anti-violence organizations</li></ul>",
    "program": {
      "undergraduate": "Bachelor of Arts (B.A.)",
      "postgraduate": "Master of Arts (M.A.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "geographic-information-sciences",
    "name": "Geographic Information Sciences",
    "department": "Geography",
    "faculty": "Arts, Humanities and Social Sciences",
    "degree": { "postgraduate": "MSc" },
    "excerpt": "The diploma in geographic information sciences is of interest to students from a broad range of backgrounds. It is a valuable complement to social and natural sciences programs such as anthropology, biology, computer sciences, earth sciences, history, economics, engineering, health and medicine, physical oceanography, environmental sciences and environmental studies.",
    "desc": "The fields of remote sensing, geographic information systems and cartography provide the most effective methods of gathering, managing, analyzing and representing geographic information. Remote sensing images provide resourceful information to observe and study cultural and physical landscapes. Examples of remote sensing applications include the monitoring of spatial changes, environmental quality evaluation, natural resource exploration, assessment and monitoring, and archaeological site assessment. Geographic information systems enable the compilation, organization, and processing of spatial (maps) and non-spatial (text statistics, graphs) data. Socio-economic, political, and environmental management decision-making is supported by the results of GIS analyses and modeling. Cartography involves the compilation, organization, and visual representation of spatial information. A variety of geographical information can effectively be communicated through cartography.",
    "requirements": "Bachelor's degree in an appropriate area of study",
    "career": "<ul><li>Analyst</li><li>Software Developer</li><li>Cartographer</li><li>Geographer</li><li>Systems analyst</li><li>Remote sensing</li><li>Urban planner</li><li>Environmental scientist</li><li>Climatologist</li><li>Archeologist</li><li>Spatial analysis</li><li>Conservationist</li><li>Cartographic Technician</li></ul>",
    "program": { "postgraduate": "Master of Science (M.Sc.)" },
    "qualification": {
      "postgraduate": "Master's degree (Postgruaduate taught)"
    },
    "duration": { "postgraduate": "1 year" }
  },
  {
    "slug": "geography",
    "name": "Geography",
    "department": "Geography",
    "faculty": "Arts, Humanities and Social Sciences",
    "degree": {
      "undergraduate": "BSc",
      "postgraduate": "MSc",
      "research": "PhD"
    },
    "excerpt": "<p>Geography literally means description of the Earth &mdash; its physical and human components and how they vary spatially. Geography studies the inter-relationships of climate, landforms, plants, animals and humans over the surface of the Earth.</p><p>Geographers are more than map-makers (though they are that, too). They are planners, researchers, environmentalists, educators and decision makers whose interests focus on some of society's most pressing questions.</p>",
    "desc": "<p>Geography has been taught here since 1946 and was raised to the status of full department in 1960. Graduate studies began in 1970 with the MSc, and the PhD was added in 1992. Our mission statement is to foster a spirit of inquiry about the geography of the world around us through our teaching and research, and to provide our students with the analytical tools needed to explore the questions that arise and the skills with which to communicate their findings.</p><p>Graduate research is conducted within the fields of climatology, cultural, historical, and economic geography, geographic information systems, geomorphology, Quaternary studies, regional development, remote sensing, and resource management. The physical and human environments of Scotland present a wide range of research possibilities. The province's easternmost coastal location in UK provides a stimulating setting for the study of the climate and the imprint of Quaternary climate changes upon the physical landscape. The social and economic characteristics observed for the Atlantic region provide a wealth of research opportunities on demographic and migration patterns, sustainable development of resources and rural development. In addition, Scotland presents considerable scope for the study of coastal and marine environments.</p><p>The Department has laboratory facilities for research in geographic information sciences, geomorphology, and paleoenvironments. A large collection of maps and aerial photographs is housed in the University's Map Library. The Department of Geography's involvement with various municipal, provincial, national, and international government agencies, private and non-profit organizations benefit students who require specialized resources or data for the support of their research. In addition, the Department of Geography takes advantage of resources offered by the research institutes housed at University.</p>",
    "requirements": "<ul><li>BSc - Direct entry into the Faculty of Arts, Humanities and Social Sciences from high school is subject to meeting the general admission, including appropriate courses in mathematics and a laboratory science. </li><li>MSc - Bachelor's degree (minimum second class) in Science, Geography, Environmental Science, Engineering or equivalent</li></ul><ul><li>PhD - Master's degree in an appropriate area of study </li></ul>",
    "career": "<p>There are many career options for geography graduates. Environmental analysis and assessment opportunities abound; locational analysis for commercial activity remains an important option; urban and regional planning continues to lure practitioners; and mapping and spatial data analyses have expanded with the wide-spread adoption of computer technologies. Teaching situations, at all levels, have been abundant as well. Geographers have long supplied their expertise to these areas, while recently adding new tools for executing these endeavours. Other options include:</p><ul><li>travel and tourism</li><li>community research</li><li>arctic investigations</li><li>international development and policy</li></ul>",
    "program": {
      "undergraduate": "Bachelor of Science (B.Sc.)",
      "postgraduate": "Master of Science (M.Sc.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "health-ethics",
    "name": "Health Ethics",
    "department": "Health Ethics",
    "faculty": "Health and Medicine",
    "degree": { "postgraduate": "MSc" },
    "excerpt": "The Master of Health Ethics degree program will help students develop the skills needed to identify and analyze ethical issues in health care and in the life sciences, and to propose solutions to these issues as they arise in the clinical, research, and policy contexts. Students will gain a basic knowledge of the functioning of the health system and will have the opportunity to design and carry out a research project.",
    "desc": "The Master in Health Ethics program is designed to be completed in two semesters of full time studies.",
    "requirements": "Bachelor's degree (minimum 75% average) and an undergraduate philosophy course with substantial ethics content (e.g., Philosophy 2040: Moral Philosophy",
    "career": "<p>Activities you could be involved in include:</p><ul><li>strategy development</li><li>medical ethics</li><li>work with medical defence unions</li><li>research</li><li>risk management</li><li>attending and presenting at conferences</li></ul>",
    "program": { "postgraduate": "Master of Science (M.Sc.)" },
    "qualification": {
      "postgraduate": "Master's degree (Postgruaduate taught)"
    },
    "duration": { "postgraduate": "1 year" }
  },
  {
    "slug": "history",
    "name": "History",
    "department": "History",
    "faculty": "Arts, Humanities and Social Sciences",
    "degree": {
      "undergraduate": "BA",
      "postgraduate": "MA",
      "research": "PhD"
    },
    "excerpt": "<p>Everything we see around us of human construction, from constitutions to popular culture, is a product of our history. The discipline of history provides an opportunity to develop research and writing skills through the study of fascinating aspects of our past.</p><p>The study of history fosters a critical understanding of the past as it relates to our present-day experience. From the depth of recorded history, this program constructs a timeline of human events that teaches us where we came from and illuminates where we are going.</p>",
    "desc": "<p>Our department sees history as a foundational discipline within the liberal arts and social science traditions, one that develops key research, writing and analytical skills, but also promotes knowledge and memory of the past as essential to an engaged citizenry.</p><p>Our teaching and research focuses on a broad range of geographical areas ranging from Scotland to the entire globe. The History Department also offers courses in themes that include film, gender, environment, military conflict, and maritime history from the ancient world to the recent past.</p>",
    "requirements": "<ul><li>BA - Direct entry into the Faculty of Arts, Humanities and Social Sciences from high school is subject to meeting the general admission.</li><li>MA - Bachelor's degree (minimum second class) in Science, Geography, Environmental Science, Engineering or equivalent</li></ul><ul><li>PhD - Master's degree in an appropriate area of study </li></ul>",
    "career": "<p>A degree in history prepares students for a variety of careers including:</p><ul><li>public administration</li><li>journalism</li><li>business administration/management</li><li>civil service</li><li>international affairs</li><li>education</li><li>libraries and archives (information studies)</li><li>law</li></ul>",
    "program": {
      "undergraduate": "Bachelor of Arts (B.A.)",
      "postgraduate": "Master of Arts (M.A.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "human-biosciences",
    "name": "Human Biosciences",
    "department": "Biochemistry",
    "faculty": "Science",
    "degree": {
      "undergraduate": "BSc",
      "postgraduate": "MSc",
      "research": "PhD"
    },
    "excerpt": "<p>How do food, drugs and the environment impact your health? That is the central question of the Human Biosciences program. </p><p>Introductory courses provide the necessary background in an interdisciplinary manner with each course blending concepts from biochemistry, nutrition, pharmacology, and toxicology.</p><p>Students may tailor their program to their own interests through diverse electives leading to one of the pre-defined sub-specialties:</p><ul><li>biochemistry,</li><li>gene regulation,</li><li>health and disease,</li><li>nutrition,</li><li>or a student-defined general Human Biosciences degree.</li></ul><p>Honours degree options involve completion of a research project that may focus on either laboratory-based research, a literature-based systematic/scoping review, education/outreach, or entrepreneurship/business projects, depending on student interests and career goals.</p>",
    "desc": "Many of our students conduct research through the University Career Experience Program (UCEP), ISWEP, Student Research Award (SRA) and other summer research programs. Ongoing research activities include studying the progression of cancer, the development of the immune system, describing protein structures that may lead to drug development, the role of small RNA in the control of gene expression, and how proteins that detect chemical signals in the body are involved in health and disease.",
    "requirements": "<ul><li>BSc - Direct entry into the Faculty of Science from high school is subject to meeting the general admission, including appropriate courses in mathematics and a laboratory science. </li><li>MSc - Bachelor's degree (minimum second class) in Science, Geography, Environmental Science, Engineering or equivalent</li></ul><ul><li>PhD - Master's degree in an appropriate area of study </li></ul>",
    "career": "<p>A degree in Human Biosciences, prepares students for a variety of careers including:</p><ul><li>researcher (academia/industry)</li><li>technical sales representative/marketing consultant</li><li>scientific/technical writer or editor</li><li>forensic scientist</li><li>clinical biochemist</li><li>professor/lecturer/teacher</li><li>medical doctor/dentist/veterinarian</li><li>patent lawyer</li><li>environmental consultant</li><li>biomedical engineer</li><li>physiotherapist/occupational therapist</li><li>genetic counsellor</li></ul>",
    "program": {
      "undergraduate": "Bachelor of Science (B.Sc.)",
      "postgraduate": "Master of Science (M.Sc.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "humanities",
    "name": "Humanities",
    "department": "Humanities",
    "faculty": "Arts, Humanities and Social Sciences",
    "degree": { "postgraduate": "MA", "research": "PhD" },
    "excerpt": "<p>Students in Humanities may expect the following: exposure to a variety of representative problems in the history and contemporary scene of human culture; education in significant methods and modes of interpretation that apply to a range of such problems; and engagement in an ongoing discussion concerning major values and human trends. Humanities concerns the human condition, past, present, and future. The human condition includes the natural world of which we are a part and from which we have distinguished ourselves, as well as the social, economic, and cultural worlds we create.</p><p>The graduate program in Humanities, offering the degree of Master of Philosophy, is an interdisciplinary teaching and research program housed in the Arts, Faculty of Humanities and Social Sciences. In a normal year, the program provides a home for approximately 20 graduate students and an interdisciplinary teaching forum for among 50 instructors and tutors from the Faculty of Arts, Humanities and Social Sciences, as well as other faculties at the University, the arts and culture community in St. Andrew, and visiting lecturers and postdoctoral fellows</p>",
    "desc": "The Master's program involves only courses and can be completed in two years of full-time study",
    "requirements": "<ul><li>MA - Bachelor's degree (minimum second class honours) in one or more of the Humanities disciplines</li><li>PhD - Masters's degree in one or more of the Humanities disciplines</li></ul>",
    "career": "<p>A humanities major often prepares you to pursue roles that require an understanding of people, creativity, communication, planning, problem-solving, teaching, as well as many other types of work.</p><p>Some common career paths for humanities majors include:</p><ul><li>Editor</li><li>Marketing analyst</li><li>Public relations specialist</li><li>Event planner</li><li>Teacher</li><li>Translator</li><li>Career coach</li><li>Entrepreneur</li></ul>",
    "program": {
      "postgraduate": "Master of Arts (M.A.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": { "postgraduate": "1 year", "research": "3 years" }
  },
  {
    "slug": "law",
    "name": "Law",
    "department": "Law",
    "faculty": "Arts, Humanities and Social Sciences",
    "degree": {
      "undergraduate": "LLB",
      "postgraduate": "LLM",
      "research": "PhD"
    },
    "excerpt": "Law is a hugely diverse field with so many paths you can go down. This degree is your classic route into the profession. You’ll cover fundamental subjects like contract and criminal law, but you’ll also have the freedom to explore areas you’re passionate about like human rights, intellectual property, corporate, property, family or medical law all supported by experts in their field. You can even apply to work in our on-campus pro-bono legal advice clinic as a volunteer or as part of your degree.",
    "desc": "<p>Our research-led teaching is delivered through lectures, tutorials and seminars. In small group tutorials of around twelve to fifteen students, you&rsquo;ll receive individual support to make sure you have fully understood the topic.</p><p>You can broaden your perspective with an optional year studying overseas, or make a difference by giving free legal advice to real clients and communities through our Pro-Bono group. We will encourage you to build practical skills through our award-winning extracurricular activities.</p><p>The Law LLB is the traditional route into the legal profession and gives you the freedom to explore the areas of law that most interest you with a wide variety of optional modules. It is an excellent stepping-stone to graduate level employment as a thought-provoking and challenging subject, giving you legal knowledge and transferable skills such as reasoning, research and problem solving. Your study will take a variety of approaches, including problem-solving, analysis of cases and statutes, examining the role of law within its social, economic and political context. The foundation subjects that you will study are recognised by the Bar Standards Board and essential for future qualification as a solicitor through the Solicitors Regulation Authority&rsquo;s approved qualification routes.</p><p>Throughout the course you will study the core branches of law with freedom to choose your modules from a broad list of specialist areas. This will broaden your understanding of the legal system, and help you make an informed decision about which area of law you might wish to pursue after graduation.</p><p>As you gain an understanding of the legal system, you will refine your own thought processes and become well-practiced in adapting your problem-solving skills to real-life scenarios.</p><p>You will graduate with guidance for completing the Solicitor&rsquo;s Qualifying Exam and barrister training courses. Employment prospects are excellent with 95% of our law students employed (or studying for a Master&rsquo;s degree) six months after graduating (DLHE). The analytical and practical skills you will learn will be your platform to a successful career in whichever field you choose.</p>",
    "requirements": "<ul><li>LLB - Direct entry into the LLB program from high school is subject to meeting the general admission.</li><li>LLM - Bachelor's degree (minimum second class) in Law or equivalent</li></ul><ul><li>PhD - Master's degree in an appropriate area of study</li></ul>",
    "career": "<ul><li>Solicitor</li><li>Arbitrator</li><li>Barrister</li><li>Barristers&#39; clerk</li><li>Chartered legal executive</li><li>Company secretary</li><li>Coroner</li><li>Judge</li><li>Lecturer of law</li><li>Legal secretary</li><li>Licensed conveyancer</li><li>Mediator</li><li>Paralegal</li><li>Patent attorney</li><li>Trade mark attorney</li><li>Usher</li></ul>",
    "program": {
      "undergraduate": "Bachelor of Laws (LL.B.)",
      "postgraduate": "Master of Laws (LL.M.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "linguistics",
    "name": "Linguistics",
    "department": "Linguistics",
    "faculty": "Arts, Humanities and Social Sciences",
    "degree": {
      "undergraduate": "BA",
      "postgraduate": "MA",
      "research": "PhD"
    },
    "excerpt": "Linguistics is the scientific study of human language, including language structure, language variation, language change, and the development of language, as well as the psychology and biology of language. Linguistics applies analytic methods to different facets of language, like childhood acquisition of language, sound patterning in language, and the ways in which social groups use language.",
    "desc": "We have the only linguistics department in Northern Scotland. The department emphasises data-driven, theoretically informed inquiry into language structure, Indigenous languages, language variation and change, and language acquisition. We host to exceptional in-house data archives, broad library holdings and state-of-the-art labs and analytical tools.",
    "requirements": "<ul><li>BA - Direct entry into the faculty is subject to your meeting the general admission requirements</li><li>MA - Bachelor's degree in Linguistics (or equivalent). Conditional admission to the MA program may be offered to applicants who do not have a Bachelor's degree in Linguistics. Admission is conditional on successful completion of a designated number of undergraduate courses.</li><li>PhD - Master's degree in Linguistics. An MA in Applied Linguistics does not qualify for entry to the PhD program.</li></ul>",
    "career": "<p>Studying linguistics prepares students for a variety of careers including:</p><ul><li>speech language pathology</li><li>documentation of endangered languages</li><li>natural language software design</li></ul>",
    "program": {
      "undergraduate": "Bachelor of Arts (B.A.)",
      "postgraduate": "Master of Arts (M.A.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "management",
    "name": "Management",
    "department": "Management",
    "faculty": "Business",
    "degree": {
      "undergraduate": "BMS",
      "postgraduate": "MMS",
      "research": "PhD"
    },
    "excerpt": "<p>Sometimes taking care of your family means taking care of yourself. Your decision to earn a business degree is as much for you as it is for them. This is why you want to choose a career that will not only support the people you love, but also allow you to enjoy going to work every day.</p><p>You've worked various jobs all your life, but you're ready to launch a career. You're committed to take the steps needed to establish a career in management, where the options are vast. It's no wonder you're considering earning a degree in management to help you achieve this goal. A management degree is a popular choice - and for good reason.</p><p>Our degrees help provide students with the versatile training they need to build a solid foundation that may be put to use in several different business administration jobs.</p>",
    "desc": "<p>This innovative program allows students to explore fundamental management topics as they relate to individuals, groups and organizations. Each cohort of students will complete the program in less than two and a half years.</p><p>The program is aimed at professionals with diverse backgrounds who are either currently employed as, or aspiring to become, managers in a broad range of organizations. Admission is limited and competitive, and is primarily intended for those who have not previously studied business or management in a post-secondary environment but who are working in or toward managerial positions and require the skillset that goes along with these. Applicants who have completed an undergraduate degree in business, commerce, management, or similar may also be considered for admission. </p>",
    "requirements": "<ul><li>BMS - Direct entry into the program is subject to your meeting the general admission requirements</li><li>MMS - Bachelor's degree in an appropriate area of study</li><li>PhD - Master's degree in an appropriate area of study</li></ul>",
    "career": "<ul><li>Marketing managers</li><li>Sales managers</li><li>Business analysts</li><li>Financial analysts</li><li>Account managers</li></ul>",
    "program": {
      "undergraduate": "Bachelor of Management Studies (B.MS.)",
      "postgraduate": "Master of Management Studies (M.MS.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "marine-biology",
    "name": "Marine Biology",
    "department": "Biology",
    "faculty": "Science",
    "degree": {
      "undergraduate": "BSc",
      "postgraduate": "MSc",
      "research": "PhD"
    },
    "excerpt": "Marine biology is the study of marine organisms, their behaviours and interactions with the environment. The marine biology major provides a wealth of experiential learning opportunities for students with a combination of wet labs, field trips and project-based courses. Get out of the classroom and into the sea or conduct your own marine project at the Ocean Sciences Centre.",
    "desc": "<p>The joint major in Marine Biology is jointly administered by the Department of Biology. It consists of core courses in oceanography and biology, and additional courses in various science subjects.</p><p>Each year we offer a number of exciting field courses at the Bonne Bay Marine Station, located in Gros Morne National Park on the west coast of the province. This world-class research and teaching facility is dedicated to marine ecology studies and has laboratories, boats, a resource centre, aquarium, multimedia theatre and residence accommodations.</p><p>Closer to St. Andrew, with a dramatic view over Logy Bay, the Ocean Sciences Centre (OSC) is a state-of-the-art research and education facility located just 10 minutes from the main campus. The OSC has wet and analytical labs that support research on cold-ocean and deep-sea processes, aquaculture, biological oceanography, as well as marine ecology, physiology and biotechnology.</p>",
    "requirements": "<ul><li>BSc - Direct entry into the program is subject to your meeting the general admission requirements</li><li>MSc - Bachelor's degree (minimum second class) in an appropriate area of study. An honours degree would be an asset</li><li>PhD - Master's degree in an appropriate area of study</li></ul>",
    "career": "<p>A degree in marine biology prepares students for a variety of careers including:</p><ul><li>marine biologist</li><li>biological oceanographer</li><li>marine science educator</li><li>fisheries officer</li><li>research/field technician</li><li>aquaculture scientist</li><li>nature interpreter</li><li>aquarium curator</li><li>scuba diver</li></ul>",
    "program": {
      "undergraduate": "Bachelor of Science (B.Sc.)",
      "postgraduate": "Master of Science (M.Sc.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "mathematics",
    "name": "Mathematics",
    "department": "Mathematics and Statistics",
    "faculty": "Science",
    "degree": {
      "undergraduate": "BSc",
      "postgraduate": "MSc",
      "research": "PhD"
    },
    "excerpt": "<p>Our Department of Mathematics and Statistics is one of the institution's youngest - half our faculty have been hired since 2005 - and most recognized - 20% of us hold the university's highest rank, University Research Professor. Although the Department of Mathematics and Statistics has offered graduate degrees for many years, the past decade has seen an explosion of interest in these programs, adding invaluable new voices to the Department's community of researchers.</p><p>Among the research areas studied by our faculty and graduate students are the following: Numerical Analysis and Scientific Computation, Analysis, Combinatorics, Topology, Applied Statistics, Differential Equations and Dynamical Systems, Mathematical Models and Modeling / Numerical Optimization, Algebra, Mathematical Physics, Mathematical Statistics, and Fluid Mechanics</p>",
    "desc": "Mathematics involves the study of the core areas of mathematics such as abstract algebra, number theory, geometry, and real and complex analysis. It is also a desirable prerequisite for almost any area of learning since it can serve as an extremely effective tool for training in logical reasoning.",
    "requirements": "<ul><li>BSc - Direct entry into the Faculty of Science from high school is subject to meeting the general admission, including appropriate courses in mathematics</li></ul><ul><li>MSc - Bachelor's degree (minimum second class) in an appropriate area of study</li></ul><ul><li>PhD - Master's degree in an appropriate area of study</li></ul>",
    "career": "<p>A degree in mathematics prepares students for a variety of careers including:</p><ul><li>accountant</li><li>actuary</li><li>investment banker</li><li>personal finance adviser</li><li>risk analyst</li><li>risk management specialist</li><li>software specialist</li><li>teacher</li></ul>",
    "program": {
      "undergraduate": "Bachelor of Science (B.Sc.)",
      "postgraduate": "Master of Science (M.Sc.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "mathematics-and-statistics",
    "name": "Mathematics and Statistics",
    "department": "Mathematics and Statistics",
    "faculty": "Science",
    "degree": {
      "undergraduate": "BSc",
      "postgraduate": "MSc",
      "research": "PhD"
    },
    "excerpt": "<p>Our Department of Mathematics and Statistics is one of the institution's youngest. Although the Department of Mathematics and Statistics has offered graduate degrees for many years, the past decade has seen an explosion of interest in these programs, adding invaluable new voices to the Department's community of researchers.</p><p>Among the research areas studied by our faculty and graduate students are the following: Numerical Analysis and Scientific Computation, Analysis, Combinatorics, Topology, Applied Statistics, Differential Equations and Dynamical Systems, Mathematical Models and Modeling / Numerical Optimization, Algebra, Mathematical Physics, Mathematical Statistics, and Fluid Mechanics.</p>",
    "desc": "<ul><li>BSc -The Bachelor program is a highly structured program incorporating both courses and an applied statistics project. A full-time student normally requires three years to complete the degree requirements.</li><li>MSc - The Master of Science is available in Mathematics or Statistics.<ul><li>The Mathematics program has two options. The research-based program consists of graduate courses and a thesis. A full-time student is expected to complete the degree requirements in two years. The course-based program is an intensive three semester (one-year) program based on graduate courses and a project.</li><li>The Statistics program consists of graduate courses and a thesis. Full-time students should complete the degree requirements within two years.</li></ul></li><li>PhD - The PhD programs in Mathematics and in Statistics consist of graduate courses, a two-part comprehensive examination, and a thesis embodying the results of original research of a high calibre. Students are expected to complete the PhD degree requirements in three to four years. Upon completion of the thesis, a final oral examination and defence of thesis must take place.</li></ul>",
    "requirements": "<ul><li>BSc - Direct entry into the program is subject to your meeting the general admission requirements</li><li>MSc - Bachelor's degree (minimum second class) in an appropriate area of study</li><li>PhD - Master's degree in an appropriate area of study</li></ul>",
    "career": "<ul><li>Data Scientist</li><li>Statistician</li><li>Actuary</li><li>Data Analyst</li><li>Operations Research Analyst</li><li>Computational Scientist</li></ul>",
    "program": {
      "undergraduate": "Bachelor of Science (B.Sc.)",
      "postgraduate": "Master of Science (M.Sc.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "mechanical-engineering",
    "name": "Mechanical Engineering",
    "department": "Mechanical Engineering",
    "faculty": "Engineering and Applied Science",
    "degree": {
      "undergraduate": "BEng",
      "postgraduate": "MEng",
      "research": "PhD"
    },
    "excerpt": "Mechanical engineering is a broad field that involves the application of physical principles for analysis, design, manufacturing and maintenance of mechanical systems. Mechanical engineering encompasses the design and manufacturing of products that are used in every facet of society; analysis and prevention of mechanical system failures; and improving the efficiency and reliability of renewable energy systems.",
    "desc": "Our mechanical engineering program is unique in that it is a co-operative education program; students will acquire up to two full years of industry experience prior to graduation. You will choose from technical streams of mechatronics; petroleum/offshore oil and gas; thermo fluids and energy; or materials and mechanics. You will complete courses in dynamics, strength of materials, vibration, automatic controls, machine design, fluid mechanics, thermodynamics, heat transfer, mathematics, materials, mechatronics, and robotics.",
    "requirements": "<ul><li>BEng - To apply for admission into the Faculty of Engineering and Applied Science, indicate bachelor of engineering in the appropriate place on the undergraduate application for admission. In addition to meeting the general admission requirements, you will also need to meet the admission requirements set out by the Faculty of Engineering and Applied Science.</li><li>MEng - Bachelor's degree (minimum second class or &lsquo;B' standing) in an appropriate area of study</li><li>PhD - Master's degree in an appropriate area of study (applicant's rank in class, referees' assessments, general performance through previous academic programs, and availability of supervisors will all be considered)</li></ul>",
    "career": "<p>An engineering degree, with a major in mechanical engineering, prepares students for a variety of careers including:</p><ul><li>machine design</li><li>manufacturing plant management</li><li>robotics design</li><li>renewable energy systems</li><li>heating, ventilation, &amp; air conditioning (HVAC)</li></ul>",
    "program": {
      "undergraduate": "Bachelor of Engineering (B.Eng.)",
      "postgraduate": "Master of Engineering (M.Eng.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "mechatronics-engineering",
    "name": "Mechatronics Engineering",
    "department": "Mechatronics Engineering",
    "faculty": "Engineering and Applied Science",
    "degree": {
      "undergraduate": "BEng",
      "postgraduate": "MEng",
      "research": "PhD"
    },
    "excerpt": "<p>Mechatronics engineering is an interdisciplinary program combining electrical and computer engineering and mechanical engineering fundamentals.</p><p>Mechatronics engineers work in diverse fields that include automation and control of mechanical systems. This includes, but is not limited to, advanced manufacturing systems, robotics, autonomous driving, navigation, and unmanned aerial vehicles (UAV), intelligent systems, remote diagnostic and telesurgery, autonomous underwater vehicles (AUV) and remotely operated underwater vehicles (ROV), machine vision, advanced sensing and instrumentation and communications.</p>",
    "desc": "Our mechatronics engineering program is unique in that it is a co-operative education program; and students will acquire up to two full years of industry experience prior to graduation. As a mechatronics engineering graduate, you will ready to contribute to the growing high-tech sector and the future digital economy. You will complete courses in mechanisms, programming, electronic circuits, automatic control, sensors and instrumentation and computer aided engineering. You will have the opportunity to choose elective courses in areas of interest to you, such as autonomous robotics and vehicles, machine learning, image processing and the Internet of Things.",
    "requirements": "<ul><li>BEng - To apply for admission into the Faculty of Engineering and Applied Science, indicate bachelor of engineering in the appropriate place on the undergraduate application for admission. In addition to meeting the general admission requirements, you will also need to meet the admission requirements set out by the Faculty of Engineering and Applied Science.</li><li>MEng - Bachelor's degree (minimum second class or &lsquo;B' standing) in an appropriate area of study</li><li>PhD - Master's degree in an appropriate area of study (applicant's rank in class, referees' assessments, general performance through previous academic programs, and availability of supervisors will all be considered)</li></ul>",
    "career": "<p>An engineering degree, with a major in mechatronics engineering, prepares students for a variety of careers including:</p><ul><li>communications, Internet-of-things, micro electromechanical systems (MEMS), robotics design</li><li>control of precision manufacturing and industrial equipment to maximize safety and energy efficiency</li><li>design of artificial limbs such as mechanical hands</li><li>design of navigation systems and autonomous vehicles, such as search and rescue vehicles for harsh environments or disaster zones</li></ul>",
    "program": {
      "undergraduate": "Bachelor of Engineering (B.Eng.)",
      "postgraduate": "Master of Engineering (M.Eng.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "medical-sciences",
    "name": "Medical Sciences",
    "department": "Medicine",
    "faculty": "Health and Medicine",
    "degree": { "undergraduate": "BSc", "postgraduate": "MSc" },
    "excerpt": "<p>Our Medical Sciences programmes are taught with the flexibility to provide students with a solid ground to enter a professional career, to undertake research or step forward to Postgraduate Study.</p><p>Research-led teaching ensures our students are being taught by those at the forefront of scientific research and who are passionate about their subject area. The diversity of subjects and flexibility of our degrees allows students to explore areas of science they may not even have considered before specialising in their chosen area.</p>",
    "desc": "<p>As a medical sciences student, you will be part of the School of Health and Medicine. As our teaching is research-led you will be taught by some of the top academics in the UK, delivered in the best possible environment with access to world class facilities.</p><p>We offer a range of degrees, and many choices within these, allowing you to shape your study to suit your career aspirations and interests. Our exciting curriculum and the opportunities we provide for you to enhance your transferable skills and employability, mean that when you graduate you will leave this University empowered and with the right skill set for the next stage of your career.</p>",
    "requirements": "<ul><li>BDS - Direct entry into the program from high school is subject to meeting the general admission, including appropriate courses in Chemistry, Biology and a laboratory science. </li><li>MSc - Bachelor's degree in an appropriate area of study</li></ul>",
    "career": "<p>Medical Science graduates can also enter directly into the world of work in diverse careers such as:</p><ul><li>Teaching, inspiring the next generation of scientists.</li><li>Patent law, working with or becoming lawyers themselves.</li><li>Medical writing, working for publishing and pharmaceutical companies.</li><li>Sports and athletics support, such as coaches, trainers, managers, physiotherapists and other fitness and nutrition professions.</li><li>Scientific-related careers, working in the Civil Service, the Health Service, medical sales, software development, management.</li><li>Research scientists in academic and industrial laboratories across the life sciences sector.</li></ul>",
    "program": {
      "undergraduate": "Bachelor of Science (B.Sc.)",
      "postgraduate": "Master of Science (M.Sc.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)"
    },
    "duration": { "undergraduate": "4 years", "postgraduate": "1 year" }
  },
  {
    "slug": "medicine",
    "name": "Medicine",
    "department": "Medicine",
    "faculty": "Health and Medicine",
    "degree": { "undergraduate": "BSc", "postgraduate": "MSc" },
    "excerpt": "<p>The Department of Medicine was established in 1967. The Faculty is housed within the Medical Education Centre adjacent to the Health Sciences Centre in St. Andrew, a modern facility which also includes the adult and women's hospital, the Janeway Children's Hospital, and the H. Bliss Murphy Cancer Centre, plus specialized units and support services.</p><p>The graduate programs are structured to create an academic environment conducive to research training excellence. The programs are designed to provide formal instruction as well as to promote informal exchange in areas of health research. There are ten areas of concentration in graduate studies in the Department of Medicine: Applied Health Services Research, Cancer and Development, Cardiovascular and Renal Sciences, Clinical Epidemiology, Community Health, Human Genetics, Immunology and Infectious Diseases, Neurosciences, Public Health, and Health Ethics. </p><p>These programs are based upon focal areas of health research within the Faculty and are dependent upon a critical mass of actively engaged faculty researchers in these areas. Each area of concentration has a program coordinator and includes a core of graduate courses appropriate to the area of health research and mechanisms for formal and informal exchange of research ideas (journal clubs, seminar series, visiting speakers program).</p>",
    "desc": "<ul><li>MSc (Med) - The MSc (Med) program involves courses and a thesis. It can be completed in two years of full-time study.</li></ul><ul><li>PhD - The PhD program involves courses, a comprehensive exam, and a thesis. It can be completed in four years of full-time study.</li></ul>",
    "requirements": "<ul><li>MSc (Med) - Bachelor's degree (minimum second class) in an appropriate area of study</li></ul><ul><li>PhD - Master's degree in an appropriate area of study</li></ul>",
    "career": "Health policy fellowship, scientific writer, grants facilitator, genetic counsellor, physiotherapy or occupational therapy, entrepreneur (start-up company), research assistant",
    "program": {
      "undergraduate": "Bachelor of Science (B.Sc.)",
      "postgraduate": "Master of Science (M.Sc.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)"
    },
    "duration": { "undergraduate": "4 years", "postgraduate": "1 year" }
  },
  {
    "slug": "medicine-and-surgery",
    "name": "Medicine and Surgery",
    "department": "Medicine",
    "faculty": "Health and Medicine",
    "degree": { "undergraduate": "BMed" },
    "excerpt": "The four year programme leading to Bachelor of Medicine and Bachelor of Surgery is designed to give you appropriate knowledge and understanding of medical, scientific and clinical principles so that you are able to apply them to the prevention, cure and alleviation of disease.",
    "desc": "<p>Studying medicine is about much more than just getting your BMed degree and becoming a doctor. Medicine is a vocation and a way of life. It's about thinking of others and putting your patients first. It's a challenging and demanding course - you'll have lots of work to do and plenty to learn, but you'll find it highly rewarding. There's great variety in terms of your workplaces, the patients and illnesses you'll encounter and the people you'll work alongside. One of the most important skills you'll need to develop is teamwork and the ability to communicate well with colleagues, patients and relatives.</p><p>Medicine is a tough profession: people who are unwell are not always easy to handle - they may, understandably, be scared or irritable. But you won't find many doctors who regret their choice of career. With all its challenges, the thrill of being a doctor never leaves you: medicine is exciting and stimulating, and diagnosing and recommending treatments and helping others is intrinsically rewarding.</p><p>The four year programme leading to Bachelor of Medicine and Bachelor of Surgery is designed to give you appropriate knowledge and understanding of medical, scientific and clinical principles so that you are able to apply them to the prevention, cure and alleviation of disease.</p><p>Key features of the curriculum include:</p><ul><li>Practical approach - you study integrated modules relating to the body systems, for example cardiovascular, respiratory etc.</li><li>Early clinical experience - you will meet your first patient in your first term.</li><li>Wide-ranging clinical experience in our hospitals in London and the South East - from Year 3, you will undertake a range of clinical and GP attachments.</li><li>Emphasis on communication skills throughout the programme.</li><li>Wide choice of Student Selected Components each year where you can follow your own interests, for example: Basic Sciences (Anatomy, Physiology, Pharmacology), to clinical specialisms, community and public health, ethics and law. Many students organise their own SSC's in an area of Medicine or Medical Science that interests them.</li><li>An element of Problem-Based Learning (PBL).</li><li>Student Support is available to you throughout your course.</li></ul>",
    "requirements": "Direct entry into the program from high school is subject to meeting the general admission, including appropriate courses in Chemistry, Biology and a laboratory science. ",
    "career": "<ul><li>Physician</li><li>Physician assistant</li><li>Pharmacist</li><li>General practitioner</li><li>Medical assistant</li><li>Internal medicine</li><li>Surgeon</li><li>Dentist</li><li>Anesthesiologist</li><li>Pharmacy</li><li>Nursing Assistant</li><li>Medical laboratory scientist</li><li>Occupational Therapist</li><li>Veterinarian</li><li>Podiatrist</li><li>Pharmacy Technicians</li><li>Physical Therapist</li><li>Respiratory Therapists</li><li>Psychiatrist</li><li>Registered Nurse</li><li>Emergency medicine</li><li>Dentistry</li><li>Anesthesiology</li></ul>",
    "program": { "undergraduate": "Bachelor of Medicine and Surgery (B.Med.)" },
    "qualification": { "undergraduate": "Bachelor's degree (Undergruaduate)" },
    "duration": { "undergraduate": "4 years" }
  },
  {
    "slug": "music",
    "name": "Music",
    "department": "Music",
    "faculty": "Arts, Humanities and Social Sciences",
    "degree": { "undergraduate": "BA", "postgraduate": "MA" },
    "excerpt": "<p>The bachelor of music is a four year program that combines the highest musical excellence in an intimate setting of student and faculty collaboration. From day one you will experience close mentorship to fast track your musical development, professional opportunities to build your career, and a program that equips you with the skills, knowledge and courage to create your musical career.</p><p>To best serve your musical ambitions, tailor your program through the following majors:</p><ul><li>Performance</li><li>Composition</li><li>Musicologies (includes music history, world music, jazz and popular music)</li><li>Joint major in musicologies and performance</li><li>Major in performance with a minor in composition</li><li>General musical studies</li><li>Comprehensive major (prepares students for specialized study in music education)</li></ul><p>Students who major in composition, general musical studies, or performance may also choose to pursue a minor in jazz studies.</p><p>Students accepted to the bachelor of music have the option to pursue a joint bachelor of music and bachelor of commerce degree.</p>",
    "desc": "<p>The School of Music is an internationally oriented professional music school. Here is some of what makes the school special:</p><ul><li><strong>Career focused.</strong> Your program will make you the best musician you can be and prepare you for a professional musical career. With courses including Career Skills for Musicians and Music in the Community, professional apprenticeships and access to our entrepreneurship opportunities, you can build a career while building your musicianship.</li><li><strong>Deep, meaningful mentorship and development.</strong> Every student receives weekly one-to-one mentorship in their area of applied study.</li><li><strong>Professional work.</strong> Your collaborations and partnerships across the music industries will provide you with an array of professional opportunities hard to find anywhere else, from performing to composing, recording to apprenticeships and much more!</li><li><strong>Music technology.</strong> In the 21<sup>st</sup> century, music and technology are inseparable. At the School of Music, you will benefit from dedicated music technology courses, a staff music technologist, and access to the state-of-the-art Electro Acoustic Research Lab.</li></ul><p>From the moment you become a music student, you will have a dedicated advisor to guide you through your degree. You will also have the opportunity to join the vibrant Music Society, the student-led organization responsible for planning events and working with faculty to enrich your experience at the School of Music. This is all in addition to the student services provided by the university. </p>",
    "requirements": "<ul><li>BA - You may apply for admission into the School of Music directly from high school by indicating School of Music - bachelor of music in the appropriate place on the undergraduate application for admission. Direct entry into the program is subject to you meeting the general admission requirements and demonstrating your excellence through your application, audition and music literacy tests. The bachelor of music is competitive for a limited number of placements. Meeting the minimum admission requirements does not guarantee your acceptance into the program.<br />If you're interested in the bachelor of music program, we encourage you to apply in your final year of high school. However, if you're not ready to pursue a music degree in your first year, you may defer your application and enroll in music elective courses that can provide excellent preparation for the first year of the program, covering topics in music history and music theory.</li><li>MA - Bachelor's degree (minimum second class) in Music</li></ul>",
    "career": "<p>With a music degree, you are limited only by your imagination.</p><p>Music studies are recognized as among the best for future success. Our graduates go on to careers as performers, composers, teachers, orchestral musicians, entrepreneurs, theorists, musicologists, music therapists, sound engineers and more. Additionally, music has set up many of our graduates for celebrated careers as doctors, lawyers, engineers and business executives.</p><p>Here's a short list of some of the amazing things our graduates do:</p><ul><li>Operatic tenor;</li><li>Concert pianist;</li><li>MTV vlogger;</li><li>Film &amp; TV composer;</li><li>Tonmeister: technology specialist &amp; sound design;</li><li>Indie rockstar;</li><li>Endocrinologist;</li><li>Dean, School of Music;</li><li>Videogame composer;</li><li>Piano technician.</li></ul>",
    "program": {
      "undergraduate": "Bachelor of Arts (B.A.)",
      "postgraduate": "Master of Arts (M.A.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)"
    },
    "duration": { "undergraduate": "4 years", "postgraduate": "1 year" }
  },
  {
    "slug": "music-education",
    "name": "Music Education",
    "department": "Music Education",
    "faculty": "Education",
    "degree": { "undergraduate": "BEd" },
    "excerpt": "A Bachelor of Education (BEd) is an undergraduate professional degree which prepares students for work as a teacher in schools.",
    "desc": "The bachelor of music education is a 45 credit hour professional program designed to prepare kindergarten to grade 12 music teachers in all facets of school music education: foundations of music education; primary/elementary and intermediate/secondary classroom music; and choral and instrumental music education. It can normally be completed in three semesters, including a one-semester internship.",
    "requirements": "Direct entry into the Faculty of Education from high school is subject to meeting the general admission.",
    "career": "The bachelor of music education is a very versatile qualification. While the program is designed for the preparation of K-12 music teachers, the skills and knowledge base can be applied to private music instruction and other professional positions related to music education. Private teachers and those wishing to go on to a career in university teaching will all benefit from this program.",
    "program": { "undergraduate": "Bachelor of Education (B.Ed.)" },
    "qualification": { "undergraduate": "Bachelor's degree (Undergruaduate)" },
    "duration": { "undergraduate": "4 years" }
  },
  {
    "slug": "nursing",
    "name": "Nursing",
    "department": "Nursing",
    "faculty": "Health and Medicine",
    "degree": {
      "undergraduate": "BSN",
      "postgraduate": "MSN",
      "research": "PhD"
    },
    "excerpt": "The nursing program is well-known for producing high-quality graduates who are sought after in this province, across the country and around the world.",
    "desc": "<p>We offer exciting Nursing programs for students who wish to continue their nursing education.</p><ul><li>The Bachelor of Science in nursing (BSN) program is designed to prepare entry-level nurses for careers in a variety of health care settings, as direct caregivers, educators, counselors, advocates, facilitators, coordinators of care, researchers, leaders and members of the nursing profession.</li><li>The Master of Science in Nursing (MSN) programs offer students the opportunity to engage with classmates from across the country and continue to work while they study.</li><li>The PhD program helps students lay the foundation for a program of research in nursing. All of the programs prepare nurses at an advanced level to contribute to evidence-informed practice and to provide leadership for change, at both the systems and individual levels, in a variety of practice settings.</li></ul>",
    "requirements": "<ul><li>BSN - Direct entry into the program from high school is subject to meeting the general admission, including appropriate courses in Chemistry or Biology, and a laboratory science.;</li><li>MSN - Bachelor's degree (minimum 3.0 CGPA) in Nursing;</li><li>PhD - Master's degree in Nursing with a minimum CGPA of 3.4; a graduate course in statistics or graduate course(s) in research (including qualitative and quantitative approaches with some advanced statistical analysis in the quantitative work).</li></ul>",
    "career": "<p>You can find our nursing graduates everywhere! Here are some examples:</p><ul><li>hospitals</li><li>community health/public health</li><li>long-term care facilities</li><li>mental health/addictions clinics</li><li>occupational health</li><li>education</li><li>research</li><li>administration</li></ul>",
    "program": {
      "undergraduate": "Bachelor in Nursing (B.SN.)",
      "postgraduate": "Master in Nursing (M.SN.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "occupational-health-and-safety",
    "name": "Occupational Health and Safety",
    "department": "Health and Safety",
    "faculty": "Health and Medicine",
    "degree": { "postgraduate": "MOHS" },
    "excerpt": "The Master of Occupational Health and Safety (MOHS) is an interdisciplinary program providing advanced-level study of multiple aspects of occupational health and safety. The program is a response to clear demand from both within the Scotland and throughout the UK.",
    "desc": "The course offerings will cover a wide range of OHS issues seen from a broadly interdisciplinary perspective, with a focus on the history and social science of OHS, workplace organization, epidemiology, treatment and prevention of occupational injuries and diseases, ergonomics and occupational hygiene.",
    "requirements": "Second class Bachelor's degree in an area of study relevant to occupational health and safety, or in medicine, nursing, occupational/physical therapy, two letters of reference, and, for applicants whose prior university instruction was not in English, demonstration of English language proficiency. Minimum TOEFL scores are: 580 for the paper-based test; 237 on the computer-based test; or 92 on the Internet-based test. The minimum IELTS score is an overall band score of 7.0. The minimum MUNTEL score is an overall band score of 70.",
    "career": "The MOHS program is designed to provide students, safety officers, loss prevention specialists and human relations managers with the analytic frameworks and up-to-date knowledge that can serve as a basis for future advanced academic study or for higher level professional careers in regulatory agencies, industry, government and stakeholder organizations. ",
    "program": {
      "postgraduate": "Master of Occupational Health and Safety (MOHS)"
    },
    "qualification": {
      "postgraduate": "Master's degree (Postgruaduate taught)"
    },
    "duration": { "postgraduate": "1 year" }
  },
  {
    "slug": "oil-and-gas-engineering",
    "name": "Oil and Gas Engineering",
    "department": "Oil and Gas Engineering",
    "faculty": "Engineering and Applied Science",
    "degree": {
      "undergraduate": "BEng",
      "postgraduate": "MEng",
      "research": "PhD"
    },
    "excerpt": "Oil and gas engineering refers to the design, implementation and operation of technical processes focused on the exploration and production of crude oil and natural gas. Once oil and gas are discovered, oil and gas engineers become involved in the process of extracting these resources from reservoirs, often working with specialists such as geoscientists to understand the underlying rock formation, determine the best drilling methods and to monitor daily operations.",
    "desc": "<p>Oil and gas engineering helps energy companies find and extract oil and gas resources more efficiently, safely and sustainably. As such, oil and gas engineers evaluate energy reservoirs to help predict their profitability and examine potential drilling sites to plan efficient and safe drilling methods needed to recover energy assets.</p><p>Engineers increasingly rely on advanced digital technologies to work more effectively. Reservoir engineers for example use advanced analytics and big data to determine the optimum field development plan and drilling activities, thereby ensuring safety and efficiency. Completion engineers leverage artificial intelligence (AI) to coax the most oil or gas flows from the ground. And production engineers ensure productivity of wells and the oilfield. With digital solutions they can monitor production from across the globe remotely using advanced sensors and the Internet of Things (IoT).</p>",
    "requirements": "<ul><li>BEng - To apply for admission into the Faculty of Engineering and Applied Science, indicate bachelor of engineering in the appropriate place on the undergraduate application for admission. In addition to meeting the general admission requirements, you will also need to meet the admission requirements set out by the Faculty of Engineering and Applied Science.</li><li>MEng - Bachelor's degree (minimum second class or 'B' standing) in an appropriate area of study</li><li>PhD - Master's degree in an appropriate area of study (applicant's rank in class, referees' assessments, general performance through previous academic programs, and availability of supervisors will all be considered)</li></ul>",
    "career": "<p>Job roles in Oil and Gas Enginering include:</p><ul><li>Drilling engineer</li><li>Energy engineer</li><li>Energy manager</li><li>Engineering geologist</li><li>Environmental consultant</li><li>Geochemist</li><li>Geophysical data processor</li><li>Geophysicist/field seismologist</li><li>Geoscientist</li><li>Mining engineer</li><li>Mudlogger</li><li>Petroleum engineer</li></ul>",
    "program": {
      "undergraduate": "Bachelor of Engineering (B.Eng.)",
      "postgraduate": "Master of Engineering (M.Eng.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "pharmacy",
    "name": "Pharmacy",
    "department": "Pharmacy",
    "faculty": "Health and Medicine",
    "degree": {
      "undergraduate": "BPharm",
      "postgraduate": "MPharm",
      "research": "PhD"
    },
    "excerpt": "The Faculty of Pharmacy provides cutting-edge research in an up-close and personal environment. The Faculty of Pharmacy provides both undergraduate and graduate students with the opportunity to conduct original research related to Drug Discovery and Delivery, Health Outcomes, and the Scholarship of Teaching and Learning. There are several research laboratories, including separate rooms for organic synthesis/natural products chemistry, a cell culture facility, pharmacology labs and state of the art computer networks. All offices and research laboratories in the Health Sciences Centre are connected as a part of the ${$app.iso}net, a high-speed network linking the campus with the world.",
    "desc": "<ul><li>BPharm - The Bachelor of Pharmacy (BPharm) is a broad-based four-year programme in the physical, biological, social and health sciences leading to registration and practice as a pharmacist.</li><li>MPharm - The MPharm program involves courses and a thesis, and can be completed in two years of full-time study. </li><li>PhD - The PhD program involves courses, a comprehensive exam, and a thesis, and can be completed in four years of full-time study.</li></ul>",
    "requirements": "Admission from high school is subject to meeting the general admission requirements, including appropriate courses in mathematics and a laboratory science",
    "career": "<p>Pharmacists may work in a variety of retail or healthcare settings. Some pharmacists may work for the government or the armed forces, or in the pharmaceutical industry conducting research.</p><ul><li>Clinical Pharmacist</li><li>Compounding Pharmacist</li><li>Hospital Staff Pharmacist</li><li>Hospital Pharmacy Director</li><li>Informatics Pharmacist</li><li>Oncology Pharmacist</li><li>Pharmacist-in-Charge</li><li>Pharmacy Manager</li><li>Retail Pharmacist</li><li>Veterinary Pharmacist</li></ul>",
    "program": {
      "undergraduate": "Bachelor of Pharmacy (B.Pharm.)",
      "postgraduate": "Master of Pharmacy (M.Pharm.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "philosophy",
    "name": "Philosophy",
    "department": "Philosophy",
    "faculty": "Arts, Humanities and Social Sciences",
    "degree": {
      "undergraduate": "BA",
      "postgraduate": "MA",
      "research": "PhD"
    },
    "excerpt": "Philosophy is the study of general and fundamental problems concerning matters such as existence, knowledge, truth, beauty, law, justice, validity, mind and language. Philosophers aim to understand reality, clarify the nature of interactions between individuals and society, and to come to terms with problems of existence and ultimate value.",
    "desc": "The Department of Philosophy aims to develop students’ intellectual abilities through examining different answers that philosophers have given to fundamental questions in order to develop a critical and systemic approach toward investigating reality and experience that relies on reasoned arguments.",
    "requirements": "<ul><li>BA - Direct entry into the program from high school is subject to meeting the&amp;nbsp;general admission</li><li>MA - Bachelor's degree (first class) in Philosophy or a closely related field</li><li>PhD - Master of Arts in Philosophy or an equivalent qualification</li></ul>",
    "career": "<p>A degree in philosophy prepares students for a variety of careers including:</p><ul><li>arts consultant</li><li>journalist</li><li>public policy manager</li></ul>",
    "program": {
      "undergraduate": "Bachelor of Arts (B.A.)",
      "postgraduate": "Master of Arts (M.A.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "physical-education",
    "name": "Physical Education",
    "department": "Physical Education",
    "faculty": "Education",
    "degree": { "undergraduate": "BA" },
    "excerpt": "The bachelor of physical education degree is designed to prepare graduates for careers in teaching and related areas",
    "desc": "<h3><strong>Teaching option</strong></h3><p>The teaching option contains courses in the fundamentals of physical education as well as courses in curriculum planning, teaching methods, and pedagogy relevant to physical education curricula for various grade levels. You will be placed in an educational setting for some of the course work.</p><p>Following completion of a physical education degree - teaching option, a student wishing to teach in a school setting will need to complete either the primary/elementary (as a second degree) or intermediate/secondary degree offered by the Faculty of Education.</p><h3><strong>General option</strong></h3><p>The general option is designed to provide basic professional preparation. This program option consists of courses common to the teaching option plus a flexible choice of elective courses.</p><h3><strong>Minor/academic discipline requirements</strong></h3><p>Among the required 10 three-credit hour elective courses, you must complete a minimum of eight courses in a minor or an acceptable academic discipline. </p>",
    "requirements": "Direct entry into the program from high school is subject to meeting the&amp;nbsp;general admission",
    "career": "<p>A bachelor of physical education prepares students for a variety of careers including:</p><ul><li>teacher</li><li>fitness/wellness management</li><li>outdoor leadership</li><li>athlete development</li><li>sports and recreation management</li><li>movement science</li><li>performance analyst</li><li>personal or athletic trainer</li></ul>",
    "program": { "undergraduate": "Bachelor of Arts (B.A.)" },
    "qualification": { "undergraduate": "Bachelor's degree (Undergruaduate)" },
    "duration": { "undergraduate": "4 years" }
  },
  {
    "slug": "physics",
    "name": "Physics",
    "department": "Physics",
    "faculty": "Science",
    "degree": {
      "undergraduate": "BSc",
      "postgraduate": "MSc",
      "research": "PhD"
    },
    "excerpt": "Through physics we attempt to understand natural phenomena in the world around us, ranging from the very small atomic nuclei and elementary particles to the very large scale of the universe. Physics is concerned with how fundamental laws influence observed phenomena which might include anything from batting a baseball to rocket dynamics. It includes fundamental theories such as those of dynamics, relativity, electricity, magnetism, thermodynamics, nuclear and elementary particles, and quantum mechanics.",
    "desc": "<ul><li>BSc - Physics majors and honours students have the option to complete a minor in applied science (process engineering) through the Faculty of Engineering and Applied Science. .</li><li>MSc - The MSc program involves four courses and a thesis and can be completed in two years of full-time study.</li><li>PhD - The PhD program involves three courses, a comprehensive exam and a thesis, and can be completed in four years of full-time study.</li></ul>",
    "requirements": "<ul><li>BSc - Direct entry into the Faculty of Science from high school is subject to meeting the general admission</li><li>MSc - Bachelor's degree (minimum second class) in Physics or equivalent</li><li>PhD - Master's degree in Physics or equivalent</li></ul>",
    "career": "<p>A degree in physics prepares students for a variety of careers including:</p><ul><li>medical imaging technician</li><li>meteorologist</li><li>teacher</li><li>technical consulting</li><li>financial analyst</li><li>radiology and radiation safety</li></ul>",
    "program": {
      "undergraduate": "Bachelor of Science (B.Sc.)",
      "postgraduate": "Master of Science (M.Sc.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "political-science",
    "name": "Political Science",
    "department": "Political Science",
    "faculty": "Arts, Humanities and Social Sciences",
    "degree": {
      "undergraduate": "BA",
      "postgraduate": "MA",
      "research": "PhD"
    },
    "excerpt": "Political science is the systematic study of politics. Political scientists consider not only the structure and operations of government, but also public opinion, political parties and elections, and the way in which they interact with governments and shape the policies they make.",
    "desc": "<ul><li>BA - Students who work towards a B.A. honours or major have the option of concentrating in UK government or in global studies. You can also gain job experience in a work internship, pursue a co-op degree, or spend a semester in Europe</li><li>MA - Disciplinary master's program offers internship, and provide an opportunity to acquire additional academic credentials at the graduate level. These programs allow students to expand on their knowledge of a particular discipline and may also be used for professional development within their careers.</li><li>PhD - The PhD program offers research paper, and thesis options. The internship option, completed in one year of full-time study, involves courses and a one-semester internship with a political organization, government agency, or voluntary agency. The research paper option, completed in one year of full-time study, involves courses and a research paper. The thesis option involves courses and a thesis, and can be completed in two years of full-time study.</li></ul>",
    "requirements": "<ul><li>BA - Direct entry into the program from high school is subject to meeting the&amp;nbsp;general admission</li><li>MA - Bachelor's degree (first class) in Political Science or a closely related field</li><li>PhD - Master of Arts in Political Science or an equivalent qualification</li></ul>",
    "career": "<p>A degree in political science prepares students for a variety of careers including:</p><ul><li>lawyer</li><li>government service worker</li><li>non-governmental organizations (NGOs)</li><li>policy analyst</li><li>researcher</li><li>media and communications</li></ul>",
    "program": {
      "undergraduate": "Bachelor of Arts (B.A.)",
      "postgraduate": "Master of Arts (M.A.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "process-engineering",
    "name": "Process Engineering",
    "department": "Process Engineering",
    "faculty": "Engineering and Applied Science",
    "degree": {
      "undergraduate": "BEng",
      "postgraduate": "MEng",
      "research": "PhD"
    },
    "excerpt": "Process engineering is a diversified discipline designed to satisfy the needs of various processing industries including oil and gas and mineral processing. It encompasses new development, design, optimization and operation of sustainable processes for human needs, ensuring safety and protection of the environment. Process engineers process substances through biological, chemical and physical processes to produce useful products such as petrochemicals, gasoline, food, pharmaceuticals, metals and alloys. ",
    "desc": "<p>Production and manufacturing engineers work in discrete manufacturing, which involves tasks like machining, assembling and riveting components into complete products, typically in an assembly line. For instance, manufacturing engineers may work in plants that produce anything from cellphones to airplanes.</p><p>In contrast, process engineers work in continuous flow manufacturing, which is also known as process manufacturing. Process manufacturing involves combining various ingredients in accordance with a recipe to produce a final product that is typically a solid, liquid, gas or powder. For instance, process engineers produce items like baby formula, butter, paint, alcohol and vaccines.</p><p>In effect, process engineers are similar to chemical engineers. Their work involves analyzing the chemical makeup of various ingredients and determining how they might react with one another. A process engineer can specialize in a number of areas, including the following:</p><ul><li>Agriculture processing</li><li>Food and dairy production</li><li>Beer and whiskey production</li><li>Cosmetics production</li><li>Pharmaceutical production</li><li>Petrochemical manufacturing</li><li>Mineral processing</li><li>Printed circuit board production</li></ul>",
    "requirements": "<ul><li>BEng - To apply for admission into the Faculty of Engineering and Applied Science, indicate bachelor of engineering in the appropriate place on the undergraduate application for admission. In addition to meeting the general admission requirements, you will also need to meet the admission requirements set out by the Faculty of Engineering and Applied Science.</li><li>MEng - Bachelor's degree (minimum second class or 'B' standing) in an appropriate area of study</li><li>PhD - Master's degree in an appropriate area of study (applicant's rank in class, referees' assessments, general performance through previous academic programs, and availability of supervisors will all be considered)</li></ul>",
    "career": "<p>An engineering degree in process engineering prepares students for a variety of careers including:</p><ul><li>process engineer</li><li>biochemical engineer</li><li>engineering consultant</li><li>pharmaceutical engineer</li><li>process design specialist</li><li>safety and control engineer</li></ul>",
    "program": {
      "undergraduate": "Bachelor of Engineering (B.Eng.)",
      "postgraduate": "Master of Engineering (M.Eng.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "Psychology",
    "name": "Psychology",
    "department": "Psychology",
    "faculty": "Science",
    "degree": {
      "undergraduate": "BSc",
      "postgraduate": "MSc",
      "research": "PhD"
    },
    "excerpt": "Psychology is the study of behaviour and the mind. As a science, psychology employs careful investigation to understand behaviour, thinking and experience. The profession of psychology applies this information to promote human welfare. The combination of writing, research and statistical analysis acquired in an undergraduate psychology degree is a sound preparation for many careers.",
    "desc": "<p>Our major programs in psychology provide students with a solid background in the science of psychology, and culminate with small classes offering direct, hands-on experience in conducting research in a wide variety of areas such as observation of sea bird behaviour, assessment of people's attitudes, and experiments on memory and spatial learning.</p><ul><li>BSc - We offer major, minor and honours programs leading to either a bachelor of arts (BA) or bachelor of science (B.Sc.) in psychology. A joint program is offered in biology/psychology (B.Sc. honours).</li><li>MSc - The MSc program involves courses and a thesis and can be completed in two years of full-time study. Students can focus their research areas on behavioural neuroscience, cognition, health and wellness, developmental psychology, or social psychology.</li><li>PhD - The PhD program involves courses, a comprehensive exam, and a thesis, and can be completed in four years of full-time study. Students can focus their research areas on behavioural neuroscience, cognition, clinical psychology, developmental psychology, or social psychology.</li></ul>",
    "requirements": "<ul><li>BSc - Direct entry into the Faculty of Science from high school is subject to meeting the general admission requirements.</li></ul><ul><li>MSc - Bachelor's degree (minimum second class honours) in an appropriate area of study.</li></ul><ul><li>PhD - Master's degree in an appropriate area of study.</li></ul>",
    "career": "<p>A degree in psychology prepares students for a variety of careers including:</p><ul><li>administration</li><li>advertising</li><li>clinical psychologist</li><li>health educator</li><li>human resources</li><li>lawyer</li><li>social services</li><li>speech-language pathologist</li></ul>",
    "program": {
      "undergraduate": "Bachelor of Science (B.Sc.)",
      "postgraduate": "Master of Science (M.Sc.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "public-policy",
    "name": "Public Policy",
    "department": "Political Science",
    "faculty": "Arts, Humanities and Social Sciences",
    "degree": {
      "undergraduate": "BA",
      "postgraduate": "MA",
      "research": "PhD"
    },
    "excerpt": "The major and minor in public policy are administered by the Department of Political Science.",
    "desc": "The study of public policy aims to provide students with an understanding of the legal underpinnings of public policy as it applies to state and non-state actors, across a wide range of domestic and international challenges. Courses in these programs are anchored in the Department of Political Science, and blend the development of key policy analysis skills—such as legal reasoning, governance, public administration, statistics, and data gathering—with coursework on topical policy issues or problems. The degree is intended to impart broad cross-disciplinary fundamentals as distinct from a specialised “pre-law” program or a Diploma in Public Policy.",
    "requirements": "<ul><li>BA - Direct entry into the faculty is subject to your meeting the general admission requirements</li><li>MA - Bachelor's degree in Public Policy (or equivalent).</li><li>PhD - Master's degree in Public Policy (or equivalent).</li></ul>",
    "career": "<p>A degree public policy prepares students for a variety of careers including:</p><ul><li>academia</li><li>business</li><li>journalism</li><li>police work</li><li>law</li><li>policy making</li><li>human resources</li></ul>",
    "program": {
      "undergraduate": "Bachelor of Arts (B.A.)",
      "postgraduate": "Master of Arts (M.A.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "religious-studies",
    "name": "Religious Studies",
    "department": "Religious Studies",
    "faculty": "Arts, Humanities and Social Sciences",
    "degree": {
      "undergraduate": "BA",
      "postgraduate": "MA",
      "research": "PhD"
    },
    "excerpt": "Religious studies is the scientific exploration of religion. It neither upholds a particular set of religious beliefs, nor seeks to debunk any of them. Rather it strives to understand the many and varied ways people in the past and present express themselves in a religious manner. In our program you can examine specific religious traditions like Buddhism, Confucianism, Christianity, Daoism, Hinduism, Islam and Judaism. You can also study a wide range of religious behaviour as expressed in popular culture, arts, and ritual as well as how religion manifests in connection with science, politics, law, and contemporary ethical issues.",
    "desc": "<p>Very little happens in the world today that does not intersect religion in some way, from international politics to the latest blockbuster film. If you are interested in the role religion plays historically and in today's world, our university is the ideal place to study. We offer the largest undergraduate and graduate program in Religious Studies in Scotland, and one of the largest in the UK. Important resources include a large library with a generous collection of periodical literature, the Religion of Scotland Archives, courses in ancient and non-western languages, strong computer support, and ten highly qualified, full-time faculty members.</p><p>One of the strengths of the graduate program is the individual attention given to students. Each student, for example, is assigned a supervisor with whom he or she designs a personalized reading course and receives individualized guidance in the preparation of a thesis, including a thesis proposal. </p><p>Faculty and graduate student research has been conducted on the following: Hinduism, philosophy of religion, Hebrew bible, new-age and pagan religious movements, Chinese and North American Buddhism, Buddhism and Psychology, Christianity, religion and popular culture, ethics and social justice, new testament, religious history of Scotland, Islam in the West.</p>",
    "requirements": "<ul><li>BA - Direct entry into the Faculty of Arts, Humanities and Social Sciences from high school is subject to meeting the general admission.</li><li>MA - Bachelor's degree (minimum second-class honours) in Religious Studies</li><li>PhD - Master's degree (minimum second-class honours) in Religious Studies</li></ul>",
    "career": "<p>A religious studies degree is good preparation for any career that includes working with people and their cultures. A few examples:</p><ul><li>international relations</li><li>education</li><li>journalism</li><li>government</li><li>legal profession</li><li>refugee/immigration support</li></ul>",
    "program": {
      "undergraduate": "Bachelor of Arts (B.A.)",
      "postgraduate": "Master of Arts (M.A.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "scientific-computing",
    "name": "Scientific Computing",
    "department": "Computer Science",
    "faculty": "Science",
    "degree": { "postgraduate": "MSc", "research": "PhD" },
    "excerpt": "<p>Our MSc program in Scientific Computing was one of the first in the UK, and remains the only such program in Scotland. Both MSc and PhD programs are now being offered in Scientific Computing. These programs train students in advanced computational techniques and in the application of these techniques to at least one scientific area, such as Applied Mathematics, Chemistry, Computer Science, Earth Sciences, Physics, or Physical Oceanography. Students can expect to gain knowledge and experience in: (1) state-of-the-art numerical methods, (2) high performance computer architectures, (3) use of software development tools for parallel and vector computers, (4) graphics, visualization, and multimedia tools, and (5) acquisition, processing, and analysis of large experimental data sets.</p><p>The MSc and PhD Scientific Computing programs are interdisciplinary, enriched by the expertise of faculty members in a range of academic units. Researchers in external organizations contribute by co-supervising students, providing placements for co-op students, providing computing resources, and teaching some courses. </p>",
    "desc": "<ul><li>MSc - A distinguishing characteristic of this program is the emphasis on interdisciplinary studies. Graduating students will have mastered a broader range of science and engineering areas than graduates from the more traditional, discipline-based programs.</li><li>PhD - The PhD program is a thesis-based program, available by full-time and part-time studies. The program is designed to produce effective researchers in Scientific Computing and within the applied areas of interest. The program's courses are designed to ensure advanced understanding of core Scientific Computing principles.</li></ul>",
    "requirements": "<ul><li>MSc - Bachelor's degree (minimum second class honours) with a strong computational and mathematical orientation, including courses in advanced Calculus, differential equations, linear algebra, numerical analysis and programming; applicants are expected to demonstrate background in the field.</li></ul><ul><li>PhD - Master's degree in Scientific Computing or in appropriate discipline. In exceptional cases, a thesis-based Honours BSc degree may be considered.</li></ul>",
    "career": "Analyst/modeler, researcher, consultant, software developer/programming, computational financial analyst, university professor, data scientist/analyst, software engineer, research computing specialist, computational scientist, quantitative engineer",
    "program": {
      "postgraduate": "Master of Science (M.Sc.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": { "postgraduate": "1 year", "research": "3 years" }
  },
  {
    "slug": "social-work",
    "name": "Social Work",
    "department": "Social Work",
    "faculty": "Arts, Humanities and Social Sciences",
    "degree": {
      "undergraduate": "BA",
      "postgraduate": "MA",
      "research": "PhD"
    },
    "excerpt": "The Faculty of Social Work has grown to become the largest in Scotland since its inception in 1963 and its BA, MA and PhD programs are taught by an internationally recognized faculty. Our PhD in Social Work program is the only one of its kind in Scotland. The Faculty promotes social justice by providing social work education, conducting scholarly inquiry, disseminating knowledge, and contributing to public policy and practice. These activities help address the needs and aspirations of the local and global communities with whom we collaborate and interact. The Faculty of Social Work plays an important role in preparing graduates for service delivery within Scotland, across the UK, and internationally.",
    "desc": "<ul><li>BA - The BA program is completed in three years of full-time study. </li><li>MA - The MA program focuses on creative approaches to critical thinking for leadership in diverse social work practice. Both thesis and course route options are available.</li><li>PhD - The PhD in Social Work program provides regionally relevant and accessible, advanced, and specialized education in social work. The program is research-based, stressing critical thinking and the production of original and significant scholarship. The program focuses on advanced social work practice and social work education, emphasizing commitment to people and social justice. The coursework period includes two, six-week Spring semester residencies, as well as a fall reading course and an internship, both of which can be completed in students' home communities.</li></ul>",
    "requirements": "<ul><li>BA - Direct entry into the Faculty of Social Work from high school is subject to meeting the general admission.</li><li>MA - Bachelor's degree (minimum second class) in Social Work and two years post-bachelor's experience</li><li>PhD - Master's degree in Social Work and three years of professional practice</li></ul>",
    "career": "<p>This program prepares graduates to be advocates, community developers and policy makers. Some areas of practice include:</p><ul><li>child and family services</li><li>gerontology</li><li>primary healthcare and long-term care</li><li>mental health and addiction services</li><li>community settings</li></ul>",
    "program": {
      "undergraduate": "Bachelor of Arts (B.A.)",
      "postgraduate": "Master of Arts (M.A.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "sociology",
    "name": "Sociology",
    "department": "Sociology",
    "faculty": "Arts, Humanities and Social Sciences",
    "degree": {
      "undergraduate": "BA",
      "postgraduate": "MA",
      "research": "PhD"
    },
    "excerpt": "Sociology explores patterns of human social life and examines the development, structuring, and organization of societies in all their historical and current diversity. Sociologists seek to understand how people live, think, feel, and believe in the ongoing processes that maintain and shift society and culture. Through understanding the social forces, structures and relationships that shape our world, sociology allows us to see why and how things are as they are, and how everything could be otherwise. Sociology is therefore central to understanding institutions, organizations, social policy, inequality, privilege, social problems and social change.",
    "desc": "Sociology aims to understand patterns of human social life in all their historical and current diversity: how people live, think, feel, believe, and act, comparing our own society with others. Our Department of Sociology is the largest in Scotland, with specialties in social theory, criminology and deviance, environmental sociology, social inequality, sociology of gender, sexuality, development, work, culture and health, including occupational health, political sociology, and maritime sociology. Faculty research engages with communities and social issues in Scotland, UK and internationally, and is regularly supported through grants from SSHRC, CIHR, and other funding bodies",
    "requirements": "<ul><li>BA - Direct entry into the Faculty of Arts, Humanities and Social Sciences from high school is subject to meeting the general admission.</li><li>MA - Bachelor's degree (minimum second class) in an appropriate area of study</li><li>PhD - Master's degree (minimum second-class honours) in Sociology</li></ul>",
    "career": "<p>A degree in sociology prepares students for a variety of careers including:</p><ul><li>admissions counsellor</li><li>child welfare officer</li><li>corrections officer</li><li>clinic worker</li></ul>",
    "program": {
      "undergraduate": "Bachelor of Arts (B.A.)",
      "postgraduate": "Master of Arts (M.A.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "software-engineering",
    "name": "Software Engineering",
    "department": "Software Engineering",
    "faculty": "Engineering and Applied Science",
    "degree": {
      "undergraduate": "BEng",
      "postgraduate": "MEng",
      "research": "PhD"
    },
    "excerpt": "Software engineers design and develop computer games, business applications, operating systems, network control systems, and middleware—to name just a few of the many career paths available.",
    "desc": "A career as a software engineer can be both fun and challenging with opportunities to work in almost any industry, including large and small businesses, government agencies, nonprofit organizations, healthcare facilities, and more. And as technology continues to evolve, the need for software developers continues to grow. Many companies are also shifting towards hiring software engineers who work from home, allowing for increased flexibility and more opportunities to enter the field.",
    "requirements": "<ul><li>BEng - To apply for admission into the Faculty of Engineering and Applied Science, indicate bachelor of engineering in the appropriate place on the undergraduate application for admission. In addition to meeting the general admission requirements, you will also need to meet the admission requirements set out by the Faculty of Engineering and Applied Science.</li><li>MEng - Bachelor's degree (minimum second class or 'B' standing) in an appropriate area of study</li><li>PhD - Master's degree in an appropriate area of study (applicant's rank in class, referees' assessments, general performance through previous academic programs, and availability of supervisors will all be considered)</li></ul>",
    "career": "<p>Graduates of the program will have knowledge and understanding of the core areas and methods of Software Engineering and will be ready to work in positions of software development, computer systems architecture and design, and distributed services. Some common careers for software engineers include:</p><ul><li>Applications Architect</li><li>Applications Developer</li><li>Computer Applications Engineer</li><li>Database Administrator</li><li>Mobile Developer</li><li>Program Manager</li><li>Programmer</li><li>Project Leader</li><li>Quality Assurance Analyst</li><li>Software Engineer</li><li>Software Quality Engineer</li><li>Systems Analyst</li><li>Systems Developer</li></ul>",
    "program": {
      "undergraduate": "Bachelor of Engineering (B.Eng.)",
      "postgraduate": "Master of Engineering (M.Eng.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "special-education",
    "name": "Special Education",
    "department": "Special Education",
    "faculty": "Education",
    "degree": { "undergraduate": "BEd" },
    "excerpt": "A Bachelor of Education (BEd) is an undergraduate professional degree which prepares students for work as a teacher in schools.",
    "desc": "The bachelor of special education program is for those who hold a prior degree in education. The program is designed to prepare teachers of kindergarten to grade 12 who specialize in accommodating learner diversity and exceptionalities in the school system. This 36 credit hour professional program is available through part-time or full-time study. A number of courses are available through online learning.",
    "requirements": "Direct entry into the Faculty of Education from high school is subject to meeting the general admission.",
    "career": "In addition to being qualified as a special education teacher, graduates of the program are often seen as having an advantage for both regular classroom and leadership positions in the school system. The skills learned, including organization and planning, conflict resolution and interagency collaboration, also provide graduates with the background for a variety of industry-based positions.",
    "program": { "undergraduate": "Bachelor of Education (B.Ed.)" },
    "qualification": { "undergraduate": "Bachelor's degree (Undergruaduate)" },
    "duration": { "undergraduate": "4 years" }
  },
  {
    "slug": "statistics",
    "name": "Statistics",
    "department": "Mathematics and Statistics",
    "faculty": "Science",
    "degree": {
      "undergraduate": "BSc",
      "postgraduate": "MSc",
      "research": "PhD"
    },
    "excerpt": "<p>Our Department of Mathematics and Statistics is one of the institution's youngest - half our faculty have been hired since 2005 - and most recognized - 20% of us hold the university's highest rank, University Research Professor. Although the Department of Mathematics and Statistics has offered graduate degrees for many years, the past decade has seen an explosion of interest in these programs, adding invaluable new voices to the Department's community of researchers.</p><p>Among the research areas studied by our faculty and graduate students are the following: Numerical Analysis and Scientific Computation, Analysis, Combinatorics, Topology, Applied Statistics, Differential Equations and Dynamical Systems, Mathematical Models and Modeling / Numerical Optimization, Algebra, Mathematical Physics, Mathematical Statistics, and Fluid Mechanics</p>",
    "desc": "Statistics involves the modelling of data from virtually every field including biology, economics and finance, engineering, environmental science and medicine, and deals with inferences using mathematical tools and probability theory. It is also a desirable prerequisite for almost any area of learning since it can serve as an extremely effective tool for training in logical reasoning.",
    "requirements": "<ul><li>BSc - Direct entry into the Faculty of Science from high school is subject to meeting the general admission, including appropriate courses in mathematics</li></ul><ul><li>MSc - Bachelor's degree (minimum second class) in an appropriate area of study</li></ul><ul><li>PhD - Master's degree in an appropriate area of study</li></ul>",
    "career": "<p>A degree in statistics prepares students for a variety of careers including:</p><ul><li>demographer</li><li>forensic statistician</li><li>teacher</li></ul>",
    "program": {
      "undergraduate": "Bachelor of Science (B.Sc.)",
      "postgraduate": "Master of Science (M.Sc.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "sustainable-aquaculture",
    "name": "Sustainable Aquaculture",
    "department": "Aquaculture ",
    "faculty": "Science",
    "degree": { "postgraduate": "MSc" },
    "excerpt": "Research activities involve the development of new species for aquaculture in the UK. Faculty expertise exists in a wide range of scientific and practical areas, including feed development and analysis, marine larviculture, fish husbandry, commercial scale feeding trials, design of grow-out systems for fish and shellfish culture, optimizing shellfish farm production, international links and consultancy, bivalve larvae, and spat monitoring.",
    "desc": "The MSc in Sustainable Aquaculture is an interdisciplinary program designed to instruct students in research using principles from a wide range of disciplines. Research problems may include field and/or laboratory studies of one or more species of marine or freshwater flora and/or fauna. The program involves courses and a thesis, and can be completed in two years of full-time study.",
    "requirements": "Bachelor's degree (minimum second class honours) in an appropriate area of study or advanced diploma in sustainable aquaculture from a Marine Institute (or equivalent)",
    "career": "Education, training, applied research, and industrial support for the ocean industries.",
    "program": { "postgraduate": "Master of Science (M.Sc.)" },
    "qualification": {
      "postgraduate": "Master's degree (Postgruaduate taught)"
    },
    "duration": { "postgraduate": "1 year" }
  },
  {
    "slug": "telecommunications-engineering",
    "name": "Telecommunications Engineering",
    "department": "Telecommunications Engineering",
    "faculty": "Engineering and Applied Science",
    "degree": {
      "undergraduate": "BEng",
      "postgraduate": "MEng",
      "research": "PhD"
    },
    "excerpt": "Telecommunications engineering is a combination of electrical engineering and computer science. It provides a thorough understanding of modern and future communication systems. This programme offers the opportunity to develop relevant skills necessary to be at the forefront of the ever-expanding and highly sought-after Telecommunications sector emerging with fresh technologies.",
    "desc": "<p>Our specialised course blends practice with theory that will equip the students with the skills and knowledge required to design, develop and deploy the next generation wireless communication systems. Our strong links with industry have allowed us to develop a practically focused course, which is essential to the needs of the rapidly changing telecommunications industry.</p><p>This course provides a thorough understanding of modern and future communication systems and offers the opportunity to develop relevant practical and theoretical knowledge necessary to be at the forefront of the rapidly evolving telecommunications sector where the demand for skilled graduates is very high. The course is also taught by field experts who are research active and known for their work and contributions to the discipline and ensures our courses remain innovative. A number of students who join this programme contribute to the existing research of the programme team.</p>",
    "requirements": "<ul><li>BEng - To apply for admission into the Faculty of Engineering and Applied Science, indicate bachelor of engineering in the appropriate place on the undergraduate application for admission. In addition to meeting the general admission requirements, you will also need to meet the admission requirements set out by the Faculty of Engineering and Applied Science.</li><li>MEng - Bachelor's degree (minimum second class or 'B' standing) in an appropriate area of study</li><li>PhD - Master's degree in an appropriate area of study (applicant's rank in class, referees' assessments, general performance through previous academic programs, and availability of supervisors will all be considered)</li></ul>",
    "career": "Students will also be ideally placed to explore a variety of roles such as Wireless Professional (LTE-A/5G/6G), Smart Monitoring Graduate Engineer (IoT), Technology Analyst, Application Analyst, Technical Support Engineer/Consulting Engineer or Software Engineer. The majority of our graduates are in roles directly related to their studies and working in programming, telecommunications engineering, and network management. Equally, graduate students may wish to pursue a career in academia or do further research.",
    "program": {
      "undergraduate": "Bachelor of Engineering (B.Eng.)",
      "postgraduate": "Master of Engineering (M.Eng.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "theatre",
    "name": "Theatre",
    "department": "Fine Arts",
    "faculty": "Arts, Humanities and Social Sciences",
    "degree": { "undergraduate": "BFA" },
    "excerpt": "<p>Our three-year bachelor of fine arts degree in theatre is the only one of its kind in Scotland. You can study acting or technical theatre production.</p><p><strong>Acting stream</strong> - Develop fundamental acting skills including voice, movement and speech. You'll learn how to apply these skills to scene study, acting technique and live performance.</p><p><strong>Technical theatre stream</strong> - Master the key skills of theatre production, including lighting, sound, wardrobe, props, carpentry, drafting, scenic painting and stage management</p>",
    "desc": "<p>Our Theatre program combines practical and academic training. In addition to working with theatre professionals, you'll get a broad liberal arts education with a strong concentration in dramatic literature. So whether you pursue your theatrical dreams or decide to use your degree as a platform for another career, you will be well prepared.</p><p>We believe in giving one-on-one attention. Our acting studio classes have a maximum of 40 students and our technical theatre production studio classes have a maximum of 25 students.</p>",
    "requirements": "Admission to our theatre program is competitive. You must meet the general admission requirements.",
    "career": "<h3><strong>Acting</strong></h3><p>Stage actor | Film and television actor | Theatre educator | Radio broadcaster | Arts administrator</p><h3><strong>Technical Theatre Production</strong></h3><p>Lighting designer | Scenic artist | Stage manager | Event planner | Prop maker | Technical director | Rigger | Film/TV crew | Operations co-ordinator | Theatre educator</p><p>Some graduates choose to move on to study other areas, such as education and law.</p>",
    "program": { "undergraduate": "Bachelor of Fine Arts (B.FA.)" },
    "qualification": { "undergraduate": "Bachelor's degree (Undergruaduate)" },
    "duration": { "undergraduate": "4 years" }
  },
  {
    "slug": "veterinary-medicine",
    "name": "Veterinary Medicine",
    "department": "Veterinary Medicine",
    "faculty": "Health and Medicine",
    "degree": { "undergraduate": "DVM" },
    "excerpt": "We offer a world class opportunity to study the scientific basis of veterinary medicine and clinical veterinary science. Our course provides the fundamental building blocks on which to develop and excel in any veterinary field.",
    "desc": "<p>The Department of Veterinary Medicine has an international reputation as a centre of excellence, and is performing world class veterinary research.</p><p>A major strength of the course is the extensive use of practical teaching and the emphasis on small-group teaching from Year 1. Our staff includes world leaders in their field and our facilities include state-of-the-art equipment.</p>",
    "requirements": "Direct entry into the program from high school is subject to meeting the&nbsp;general admission, including appropriate courses in Chemistry, Biology and a laboratory science.&nbsp;",
    "career": "<p>This programme will train and prepare you for a career as a veterinary practitioner, either in general practice or a specialised field of practice, such as:</p><ul><li>small animal</li><li>farm animal</li><li>equine</li><li>exotic animal</li></ul><p>It also prepares you for further training in a specialised clinical field.</p><p>Opportunities exist for you to get involved in:</p><ul><li>wildlife disease prevention</li><li>endangered species conservation</li><li>government service</li><li>livestock husbandry education in the developing world</li></ul><h3><strong>Research</strong></h3><p>Alternatively, you can pursue a research career.</p><p>Our school incorporates the Roslin Institute. This, along with the Moredun Research Institute and Scotland&#39;s Rural College, makes up the Easter Bush Research Consortium. Together, we have one of the world&#39;s highest concentrations of animal scientists.</p><p>While many of our graduates enter the veterinary profession for life, many others find that their training at Edinburgh enables them to pursue a career in:</p><ul><li>research</li><li>government</li><li>private enterprise</li><li>academia</li></ul>",
    "program": { "undergraduate": "Doctor of Veterinary Medicine (D.VM.)" },
    "qualification": { "undergraduate": "Bachelor's degree (Undergruaduate)" },
    "duration": { "undergraduate": "4 years" }
  },
  {
    "slug": "veterinary-science",
    "name": "Veterinary Science",
    "department": "Veterinary Science",
    "faculty": "Science",
    "degree": {
      "undergraduate": "BVSc",
      "postgraduate": "MVSc",
      "research": "PhD"
    },
    "excerpt": "Our university is the leading Scotland University in veterinary related areas with a strong research and teaching reputation in the area of animal health. The University’s track record in veterinary related research spans over one hundred years, with particular expertise in livestock, such as parasitology and, with the recent establishment of the Centre of Excellence for Bovine TB, also microbiology. ",
    "desc": "<p>Students will graduate with the knowledge, skills and experience to be effective practitioners in a profession where there is an increasing demand for appropriately qualified staff.&nbsp;</p><p>The Veterinary Science course has been designed to train students to identify, medically and surgically treat, and prevent diseases of animals, including household pets, farm animals, zoo animals, and horses.</p>",
    "requirements": "<ul><li>BVSc &ndash; Direct entry into the Department of&nbsp;Veterinary Science from high school is subject to meeting the&nbsp;general admission, including appropriate courses in Chemistry and a Laboratory Science, and either biology or mathematics.&nbsp;</li><li>MVSc &ndash; Bachelor&#39;s degree (minimum second class) in Veterinary Science or equivalent</li></ul><ul><li>PhD &ndash; Master&rsquo;s degree in an appropriate area of study&nbsp;</li></ul>",
    "career": "<p>Graduates develop an in-depth scientific knowledge that may be applied to a number of different career pathways.</p><p>These include mixed clinical practice, equine practices, farm/ livestock practices, veterinary research, veterinary public health and policy, pharmaceutical industry, food security and conservation medicine.</p><p>Additionally, having trained partially in Wales throughout the degree, graduates will be extremely well-suited to continuing their career in Welsh practices and other veterinary institutions and employers in Wales or rural practice.</p>",
    "program": {
      "undergraduate": "Bachelor of Veterinary Science (B.VSc.)",
      "postgraduate": "Master of Veterinary Science (M.VSc.)",
      "research": "Doctor of Philosophy (Ph.D.)"
    },
    "qualification": {
      "undergraduate": "Bachelor's degree (Undergruaduate)",
      "postgraduate": "Master's degree (Postgruaduate taught)",
      "research": "Postgraduate research"
    },
    "duration": {
      "undergraduate": "4 years",
      "postgraduate": "1 year",
      "research": "3 years"
    }
  },
  {
    "slug": "visual-arts",
    "name": "Visual Arts",
    "department": "Fine Arts",
    "faculty": "Arts, Humanities and Social Sciences",
    "degree": { "undergraduate": "BFA" },
    "excerpt": "<p>Visual artists are driven by their passion to express themselves through their work and are motivated their surroundings. It's the way you perceive and interpret the world.</p><p>The visual arts program is an immersive studio-based, four-year degree program in contemporary art. Explore your creativity through different areas of visual art, such as</p><ul><li>Drawing</li><li>Painting</li><li>Sculpture</li><li>Printmaking</li><li>Photography</li><li>New media and digital imaging</li><li>Installation</li><li>Time-based practices</li><li>Art history/visual culture</li><li>Textile/fibre art</li></ul>",
    "desc": "<p>The visual arts program allows students to express themselves through various art forms and media. Our instructors support students in their journey to find the materials, processes, and practices that best suit their artistic visions. We will help you to enhance your technical skill, while developing your creative intent. Our program will also introduce you to contemporary art practices and give you the opportunity to work with celebrated national and international artists.</p><p> </p><p>We have extensive facilities, dedicated to our visual arts program with a commitment to safe studio practices. In our department you will have access to: </p><ul><li>Studio space for painting and drawing with studio lighting, ventilation, easels, and storage</li><li>Printshops for lithography, intaglio, relief, serigraphy, and a graphic arts darkroom</li><li>Photography facilities, including darkrooms, a large digital inkjet printer, and shooting studio</li><li>Fully-equipped sculpture studio with three ceramic kilns, a fully-equipped woodshop and an outdoor carving area.</li><li>New media lab with Apple computer systems drawing tablets and industry standard applications from Adobe and Apple, facilitating production of print media, video, sound, animation and code.</li><li>Our Campus Art Gallery</li></ul>",
    "requirements": "Admission to our Visual Arts program is competitive. You must meet the general admission requirements.",
    "career": "<p>There are many exciting career opportunities for graduates of our visual arts program, including:</p><ul><li>Artist</li><li>Curator</li><li>Illustrator</li><li>Gallery owner</li><li>Animator</li><li>Graphic designer</li><li>Art administrator</li><li>Video game designer</li><li>Art teacher</li><li>Art therapist</li><li>Art conservation</li><li>and many more!</li></ul><p>​Some graduates go on to study other areas such as architecture, forensic artistry and police photography, journalism, education, law, medicine and more. A visual arts degree is a respected stepping-stone in your career; it demonstrates creative thinking, problem solving and innovation.</p>",
    "program": { "undergraduate": "Bachelor of Fine Arts (B.FA.)" },
    "qualification": { "undergraduate": "Bachelor's degree (Undergruaduate)" },
    "duration": { "undergraduate": "4 years" }
  }
]
